[
    {
        "question_1": "What was Amazon's total revenue in 2023?",
        "answer_1": "$575B",
        "question_2": "By what percentage did Amazon's AWS revenue increase in 2023?",
        "answer_2": "13%",
        "question_3": "How much did Amazon's operating income improve in 2023 from the previous year?",
        "answer_3": "201%",
        "filename": "./docs\\Amazon-com-Inc-2023-Annual-Report.pdf",
        "first_5_page_texts": "ANNUAL REPORT2 0 2 3Dear Shareholders:\nLast year at this time, I shared my enthusiasm and optimism for Amazon’s future. Today, I have even more.\nThe reasons are many, but start with the progress we’ve made in our financial results and customer\nexperiences, and extend to our continued innovation and the remarkable opportunities in front of us.\nIn 2023, Amazon’s total revenue grew 12% year-over-year (“Y oY”) from $514B to $575B. By segment, North\nAmerica revenue increased 12% Y oY from $316B to $353B, International revenue grew 11% Y oY from\n$118B to $131B, and AWS revenue increased 13% Y oY from $80B to $91B.\nFurther, Amazon’s operating income and Free Cash Flow (“FCF”) dramatically improved. Operating\nincome in 2023 improved 201% Y oY from $12.2B (an operating margin of 2.4%) to $36.9B (an operating\nmargin of 6.4%). Trailing Twelve Month FCF adjusted for equipment finance leases improved from -$12.8B\nin 2022 to $35.5B (up $48.3B).\nWhile we’ve made meaningful progress on our financial measures, what we’re most pleased about is the\ncontinued customer experience improvements across our businesses.\nIn our Stores business, customers have enthusiastically responded to our relentless focus on selection, price,\nand convenience. We continue to have the broadest retail selection, with hundreds of millions of products\navailable, tens of millions added last year alone, and several premium brands starting to list on Amazon\n(e.g. Coach, Victoria’s Secret, Pit Viper, Martha Stewart, Clinique, Lancôme, and Urban Decay).\nBeing sharp on price is always important, but particularly in an uncertain economy, where customers are\ncareful about how much they’re spending. As a result, in Q4 2023, we kicked off the holiday season with Prime\nBig Deal Days, an exclusive event for Prime members to provide an early start on holiday shopping. This\nwas followed by our extended Black Friday and Cyber Monday holiday shopping event, open to all customers,\nthat became our largest revenue event ever. For all of 2023, customers saved nearly $24B across millions of\ndeals and coupons, almost 70% more than the prior year.\nWe also continue to improve delivery speeds, breaking multiple company records. In 2023, Amazon\ndelivered at the fastest speeds ever to Prime members, with more than 7 billion items arriving same or next\nday, including more than 4 billion in the U.S. and more than 2 billion in Europe. In the U.S., this result is the\ncombination of two things. One is the benefit of regionalization, where we re-architected the network to\nstore items closer to customers. The other is the expansion of same-day facilities, where in 2023, we increased\nthe number of items delivered same day or overnight by nearly 70% Y oY . As we get items to customers this\nfast, customers choose Amazon to fulfill their shopping needs more frequently, and we can see the results in\nvarious areas including how fast our everyday essentials business is growing (over 20% Y oY in Q4 2023).\nOur regionalization efforts have also trimmed transportation distances, helping lower our cost to serve. In\n2023, for the first time since 2018, we reduced our cost to serve on a per unit basis globally. In the U.S. alone,\ncost to serve was down by more than $0.45 per unit Y oY . Decreasing cost to serve allows us both to invest\nin speed improvements and afford adding more selection at lower Average Selling Prices (“ASPs”). More\nselection at lower prices puts us in consideration for more purchases.\nAs we look toward 2024 (and beyond), we’re not done lowering our cost to serve. We’ve challenged every\nclosely held belief in our fulfillment network, and reevaluated every part of it, and found several areas where\nwe believe we can lower costs even further while also delivering faster for customers. Our inbound fulfillment\narchitecture and resulting inventory placement are areas of focus in 2024, and we have optimism there’s\nmore upside for us.\nInternationally, we like the trajectory of our established countries, and see meaningful progress in our\nemerging geographies (e.g. India, Brazil, Australia, Mexico, Middle East, Africa, etc.) as they continue toexpand selection and features, and move toward profitability (in Q4 2023, Mexico became our latest\ninternational Stores locale to turn profitable). We have high conviction that these new geographies will\ncontinue to grow and be profitable in the long run.\nAlongside our Stores business, Amazon’s Advertising progress remains strong, growing 24% Y oY from\n$38B in 2022 to $47B in 2023, primarily driven by our sponsored ads. We’ve added Sponsored TV to this\noffering, a self-service solution for brands to create campaigns that can appear on up to 30+ streaming\nTV services, including Amazon Freevee and Twitch, and have no minimum spend. Recently, we’ve expanded\nour streaming TV advertising by introducing ads into Prime Video shows and movies, where brands can\nreach over 200 million monthly viewers in our most popular entertainment offerings, across hit movies and\nshows, award-winning Amazon MGM Originals, and live sports like Thursday Night Football . Streaming\nTV advertising is growing quickly and off to a strong start.\nShifting to AWS, we started 2023 seeing substantial cost optimization, with most companies trying to save\nmoney in an uncertain economy. Much of this optimization was catalyzed by AWS helping customers use the\ncloud more efficiently and leverage more powerful, price-performant AWS capabilities like Graviton chips\n(our generalized CPU chips that provide ~40% better price-performance than other leading x86 processors),\nS3 Intelligent Tiering (a storage class that uses AI to detect objects accessed less frequently and store them\nin less expensive storage layers), and Savings Plans (which give customers lower prices in exchange for longer\ncommitments). This work diminished short-term revenue, but was best for customers, much appreciated,\nand should bode well for customers and AWS longer-term. By the end of 2023, we saw cost optimization\nattenuating, new deals accelerating, customers renewing at larger commitments over longer time periods, and\nmigrations growing again.\nThe past year was also a significant delivery year for AWS. We announced our next generation of generalized\nCPU chips (Graviton4), which provides up to 30% better compute performance and 75% more memory\nbandwidth than its already-leading predecessor (Graviton3). We also announced AWS Trainium2 chips,\nwhich will deliver up to four times faster machine learning training for generative AI applications and three\ntimes more memory capacity than Trainium1. We continued expanding our AWS infrastructure footprint,\nnow offering 105 Availability Zones within 33 geographic Regions globally, with six new Regions coming\n(Malaysia, Mexico, New Zealand, the Kingdom of Saudi Arabia, Thailand, and a second German region\nin Berlin). In Generative AI (“GenAI”), we added dozens of features to Amazon SageMaker to make it easier\nfor developers to build new Foundation Models (“FMs”). We invented and delivered a new service (Amazon\nBedrock) that lets companies leverage existing FMs to build GenAI applications. And, we launched the\nmost capable coding assistant around in Amazon Q. Customers are excited about these capabilities, and we’re\nseeing significant traction in our GenAI offerings. (More on how we’re approaching GenAI and why we\nbelieve we’ll be successful later in the letter.)\nWe’re also making progress on many of our newer business investments that have the potential to be\nimportant to customers and Amazon long-term. Touching on two of them:\nWe have increasing conviction that Prime Video can be a large and profitable business on its own. This\nconfidence is buoyed by the continued development of compelling, exclusive content (e.g. Thursday Night\nFootball, Lord of the Rings, Reacher, The Boys, Citadel, Road House , etc.), Prime Video customers’ engagement\nwith this content, growth in our marketplace programs (through our third-party Channels program, as\nwell as the broad selection of shows and movies customers rent or buy), and the addition of advertising in\nPrime Video.\nIn October, we hit a major milestone in our journey to commercialize Project Kuiper when we launched two\nend-to-end prototype satellites into space, and successfully validated all key systems and sub-systems—\nrare in an initial launch like this. Kuiper is our low Earth orbit satellite initiative that aims to provide\nbroadband connectivity to the 400-500 million households who don’t have it today (as well as governments\nand enterprises seeking better connectivity and performance in more remote areas), and is a very large revenue\nopportunity for Amazon. We’re on track to launch our first production satellites in 2024. We’ve still got a\nlong way to go, but are encouraged by our progress.\nOverall, 2023 was a strong year, and I’m grateful to our collective teams who delivered on behalf of\ncustomers. These results represent a lot of invention, collaboration, discipline, execution, and reimaginationacross Amazon. Yet, I think every one of us at Amazon believes that we have a long way to go, in every one\nof our businesses, before we exhaust how we can make customers’ lives better and easier, and there is\nconsiderable upside in each of the businesses in which we’re investing.\n===\nIn my annual letter over the last three years, I’ve tried to give shareholders more insight into how we’re\nthinking about the company, the businesses we’re pursuing, our future opportunities, and what makes us\ntick. We operate in a diverse number of market segments, but what ties Amazon together is our joint mission\nto make customers’ lives better and easier every day. This is true across every customer segment we serve\n(consumers, sellers, brands, developers, enterprises, and creators). At our best, we’re not just customer\nobsessed, but also inventive, thinking several years out, learning like crazy, scrappy, delivering quickly, and\noperating like the world’s biggest start-up.\nWe spend enormous energy thinking about how to empower builders, inside and outside of our company.\nWe characterize builders as people who like to invent. They like to dissect a customer experience, assess what’s\nwrong with it, and reinvent it. Builders tend not to be satisfied until the customer experience is perfect.\nThis doesn’t hinder them from delivering improvements along the way, but it drives them to keep tinkering\nand iterating continually. While unafraid to invent from scratch, they have no hesitation about using\nhigh-quality, scalable, cost-effective components from others. What matters to builders is having the right\ntools to keep rapidly improving customer experiences.\nThe best way we know how to do this is by building primitive services . Think of them as discrete, foundational\nbuilding blocks that builders can weave together in whatever combination they desire. Here’s how we\ndescribed primitives in our 2003 AWS Vision document:\n“Primitives are the raw parts or the most foundational-level building blocks for software developers. They’re indivisible\n(if they can be functionally split into two they must) and they do one thing really well. They’re meant to be used\ntogether rather than as solutions in and of themselves. And, we’ll build them for maximum developer flexibility. We\nwon’t put a bunch of constraints on primitives to guard against developers hurting themselves. Rather, we’ll optimize for\ndeveloper freedom and innovation.”\nOf course, this concept of primitives can be applied to more than software development, but they’re\nespecially relevant in technology. And, over the last 20 years, primitives have been at the heart of how we’ve\ninnovated quickly.\nOne of the many advantages to thinking in primitives is speed . Let me give you two counter examples that\nillustrate this point. First, we built a successful owned-inventory retail business in the early years at Amazon\nwhere we bought all our products from publishers, manufacturers, and distributors, stored them in our\nwarehouses, and shipped them ourselves. Over time, we realized we could add broader selection and lower\nprices by allowing third-party sellers to list their offerings next to our own on our highly trafficked search and\nproduct detail pages. We’d built several core retail services (e.g. payments, search, ordering, browse, item\nmanagement) that made trying different marketplace concepts simpler than if we didn’t have those\ncomponents. A good set of primitives? Not really.\nIt turns out that these core components were too jumbled together and not partitioned right. We learned\nthis the hard way when we partnered with companies like Target in our Merchant.com business in the early\n2000s. The concept was that target.com would use Amazon’s ecommerce components as the backbone of\nits website, and then customize however they wished. To enable this arrangement, we had to deliver those\ncomponents as separable capabilities through application programming interfaces (“APIs”). This decoupling\nwas far more difficult than anticipated because we’d built so many dependencies between these services as\nAmazon grew so quickly the first few years.\nThis coupling was further highlighted by a heavyweight mechanism we used to operate called “NPI.” Any\nnew initiative requiring work from multiple internal teams had to be reviewed by this NPI cabal where each\nteam would communicate how many people-weeks their work would take. This bottleneck constrained\nwhat we accomplished, frustrated the heck out of us, and inspired us to eradicate it by refactoring theseecommerce components into true primitive services with well-documented, stable APIs that enabled our\nbuilders to use each other’s services without any coordination tax.\nIn the middle of the Target and NPI challenges, we were contemplating building a new set of infrastructure\ntechnology services that would allow both Amazon to move more quickly and external developers to\nbuild anything they imagined. This set of services became known as AWS, and the above experiences\nconvinced us that we should build a set of primitive services that could be composed together how anybody\nsaw fit. At that time, most technology offerings were very feature-rich, and tried to solve multiple jobs\nsimultaneously. As a result, they often didn’t do any one job that well.\nOur AWS primitive services were designed from the start to be different. They offered important, highly\nflexible, but focused functionality. For instance, our first major primitive was Amazon Simple Storage Service\n(“S3”) in March 2006 that aimed to provide highly secure object storage, at very high durability and\navailability, at Internet scale, and very low cost. In other words, be stellar at object storage. When we launched\nS3, developers were excited, and a bit mystified. It was a very useful primitive service, but they wondered,\nwhy just object storage? When we launched Amazon Elastic Compute Cloud (“EC2”) in August 2006 and\nAmazon SimpleDB in 2007, people realized we were building a set of primitive infrastructure services that\nwould allow them to build anything they could imagine, much faster, more cost-effectively, and without\nhaving to manage or lay out capital upfront for the datacenter or hardware. As AWS unveiled these building\nblocks over time (we now have over 240 at builders’ disposal—meaningfully more than any other provider),\nwhole companies sprang up quickly on top of AWS (e.g. Airbnb, Dropbox, Instagram, Pinterest, Stripe, etc.),\nindustries reinvented themselves on AWS (e.g. streaming with Netflix, Disney+, Hulu, Max, Fox,\nParamount), and even critical government agencies switched to AWS (e.g. CIA, along with several other\nU.S. Intelligence agencies). But, one of the lesser-recognized beneficiaries was Amazon’s own consumer\nbusinesses, which innovated at dramatic speed across retail, advertising, devices (e.g. Alexa and FireTV),\nPrime Video and Music, Amazon Go, Drones, and many other endeavors by leveraging the speed with which\nAWS let them build. Primitives, done well, rapidly accelerate builders’ ability to innovate .\nSo, how do you build the right set of primitives?\nPursuing primitives is not a guarantee of success. There are many you could build, and even more ways to\ncombine them. But, a good compass is to pick real customer problems you’re trying to solve .\nOur logistics primitives are an instructive example. In Amazon’s early years, we built core capabilities\naround warehousing items, and then picking, packing, and shipping them quickly and reliably to customers.\nAs we added third-party sellers to our marketplace, they frequently requested being able to use these same\nlogistics capabilities. Because we’d built this initial set of logistics primitives, we were able to introduce\nFulfillment by Amazon (“FBA ”) in 2006, allowing sellers to use Amazon’s Fulfillment Network to store\nitems, and then have us pick, pack, and ship them to customers, with the bonus of these products being\navailable for fast, Prime delivery. This service has saved sellers substantial time and money (typically about\n70% less expensive than doing themselves), and remains one of our most popular services. As more merchants\nbegan to operate their own direct-to-consumer (“DTC”) websites, many yearned to still use our fulfillment\ncapabilities, while also accessing our payments and identity primitives to drive higher order conversion on\ntheir own websites (as Prime members have already shared this payment and identity information with\nAmazon). A couple years ago, we launched Buy with Prime to address this customer need. Prime members\ncan check out quickly on DTC websites like they do on Amazon, and receive fast Prime shipping speeds on\nBuy with Prime items—increasing order conversion for merchants by ~25% vs. their default experience.\nAs our Stores business has grown substantially, and our supply chain become more complex, we’ve had to\ndevelop a slew of capabilities in order to offer customers unmatched selection, at low prices, and with very fast\ndelivery times. We’ve become adept at getting products from other countries to the U.S., clearing customs,\nand then shipping to storage facilities. Because we don’t have enough space in our shipping fulfillment centers\nto store all the inventory needed to maintain our desired in-stock levels, we’ve built a set of lower-cost,\nupstream warehouses solely optimized for storage (without sophisticated end-user, pick, pack, and ship\nfunctions). Having these two pools of inventory has prompted us to build algorithms predicting when we’ll\nrun out of inventory in our shipping fulfillment centers and automatically replenishing from these upstream"
    },
    {
        "question_1": "When was Huawei founded?",
        "question_2": "How much revenue did Huawei generate in 2023?",
        "question_3": "How many employees does Huawei have in 2023?",
        "filename": "./docs\\annual_report_2023_en.pdf",
        "first_5_page_texts": "Huawei Investment & Holding Co., Ltd.\n2023 ANNUAL REPORTWho is Huawei?\nFounded in 1987, Huawei is a leading \nglobal provider of information and \ncommunications technology (ICT) \ninfrastructure and smart devices. We \nhave approximately 207,000 employees \nand we operate in over 170 countries \nand regions, serving more than three \nbillion people around the world. We are \ncommitted to bringing digital to every \nperson, home and organization for a \nfully connected, intelligent world.Walking the walk for steady,  \nlong-term growth\nLaying the groundwork for an intelligent world\nIn 2023, we witnessed rapid advancement in emerging \ntechnologies like artificial intelligence (AI) and nonstop innovation \nin new applications for business. AI development has evolved \nfrom customization on a small scale to massive application at \nan industrial level, while digital technology has become more \ndeeply integrated with every aspect of our lives. This digital and \nintelligent transformation is bringing new value to individuals and \nbreathing new life into enterprises. We want to help all industries \nmake the most of these new developments. So we are leveraging \nthe collective strengths of our business portfolio, backed by a \nsolid grasp on complex hardware and software platforms, to build \na solid foundation for a digital and intelligent world.\nDelving deep into basic research and driving technological \ninnovation\nHuawei values research and innovation, and we take an \nopen approach to both. We continue to delve deep into basic \nscientific and theoretical research, and are working closely with \nacademia and the industry to push innovation forward. Together \nwith our customers and partners, we are pushing the limits of \ntechnology to address broader industry challenges. We also \ndevelop innovative products and solutions to address the unique \nproblems our customers face. We want to create greater value \nfor the world.\nFor the past three years, we have invested more than 20% of our \nannual sales revenue back into research and development. Our \naim is to drive industry development to help pave the way for the \nimminent arrival of an intelligent world – one with 100 billion \nconnections and a universal 10 gigabit experience.\nPrioritizing security and trustworthiness, succeeding through \nquality\nCyber security and privacy protection are Huawei's top priorities. \nWe continue to build up and improve on our end-to-end \ncyber security assurance system, embedding cyber security \nrequirements into all aspects of our operations, including policy, \nmanagement, and technology. Through industry exchange and \ninternational cooperation, we also share best practices and work with stakeholders to build a secure, trustworthy, and intelligent \nworld. Our efforts have earned worldwide recognition, and we \ncontinue to maintain a solid track record in cyber security in over \n170 markets around the world. Customer trust is the most solid \ntestament to the security of our products and services.\nQuality is our path to success. Over more than three decades \nin the ICT domain, we have built up significant capabilities \nand experience in quality management and are adapting this \nexperience to meet the needs of new business domains. We are \nalso sharing these capabilities with our suppliers, channel partners, \nand other partners. Through end-to-end quality management \nsystems, we provide our customers with more competitive \nproducts and solutions.\nBuilding up thriving ecosystems for a more dynamic industry\nDigital, intelligent, and low-carbon transformation will continue to \nbe major development trends moving forward. We will continue to \nmaintain strategic focus while supporting free trade, open markets, \nand fair competition. We are committed to driving healthy \nindustry development and creating value for our customers, \npartners, and the world. To make this happen, we are working to \npromote a more open, diverse, and inclusive ecosystem.\nWe value openness and collaboration and work hard to help \nothers succeed. In particular, we are actively developing platform \ncapabilities for ecosystem-centric domains like HarmonyOS, \nKunpeng, Ascend, and cloud computing, and we are combining \nstrengths across the industry to promote the development \nof business ecosystems. By enabling ecosystem partners and \nenhancing experience for developers, we hope to stimulate \ninnovation and drive shared success.\nPowering sustainable development with technology\nWe use advanced ICT solutions to help industries reduce their \ncarbon emissions and accelerate the construction of new energy \ninfrastructure. This is part of our broader efforts to foster a more \ncircular economy and maximize the value of digital technology in \npowering green development.\nWe do our best to give back, and hope to make the intelligent \nworld a more inclusive, sustainable place. In particular, we are \nusing technology like broadband, cloud, and AI to promote \nequitable and quality education, environmental protection, \nand balanced development. We have also expanded our talent \ndevelopment program – Seeds for the Future – to help foster the \nnext generation of digital talent. Through this program, we are \nnurturing digital leadership, helping young people build digital \nskills, and upskilling ICT professionals. To date, this program has \nbenefited more than 3.4 million people from around the world.Contents\nMessage from the Rotating Chairman\nBusiness Highlights in 2023\nFive-Year Financial Highlights\nMessage from the Chairman02\n05\n07\n08\n12\n17\n91\n92\n135Industry Trends\nManagement Discussion and Analysis\nIndependent Auditors' Report\n Consolidated Financial Statements  \nSummary\nRisk Factors\n138\n155\n189Corporate Governance Report\nSustainable Development\n Abbreviations, Financial Terminology,  \nand Exchange Rates\n02       Huawei Investment & Holding Co., Ltd.\nMessage from the Rotating Chairman\nWe've been through a lot over the past few years. But \nthrough one challenge after another, we've managed \nto grow.\nWe rounded off 2023 with CNY704.2 billion in revenue. \nOur ICT infrastructure business remained solid, and our \nconsumer business met expectations. Both our cloud \ncomputing and digital power businesses grew steadily, \nand our intelligent automotive solution business began \nlarge-scale delivery.\nThe trust and support of our customers, partners, \nand friends around the world is what helped us keep \ngoing, keep surviving, and keep growing. On behalf \nof Huawei, I'd like to extend our heartfelt gratitude to \neveryone for your ongoing support.\nThroughout the past year, the entire team at Huawei \nhas been forging ahead, working closely with partners \nto drive shared success and create value for our \ncustomers.\nIn the ICT infrastructure domain, we worked side-by-\nside with our carrier customers to maximize returns on \ntheir 5G network investment and steadily advance the \ncommercial deployment of 5.5G.\nIn the enterprise domain, we differentiated our \nproducts, portfolios, and industry solutions based on \nthe unique needs of different types of customers, \nincluding named accounts, SMEs, and MSMEs.\nIn the consumer domain, the HUAWEI Mate 60 Series \nand the HarmonyOS ecosystem received wide acclaim.\nIn cloud computing, we moved ahead with our AI for \nIndustries strategy. We launched innovative products \nlike our Pangu Models 3.0 and Ascend AI cloud service, \nwhich are designed to provide all industries with a \nsolid cloud foundation for going digital.\nIn the energy domain, Huawei Digital Power continues \nto use digital technology to help power the world's \ngreen and low-carbon development. In 2023, we made \ntremendous progress in areas like smart PVs and \nliquid-cooled ultra-fast charging.2023 Annual Report        03And in the automotive domain, our solutions like \nintelligent driving and intelligent cockpits saw large-scale \nadoption in a growing number of automotive brands.\nOpen innovation for an intelligent \nworld\nIn today's world, emerging technologies progress \nby leaps and bounds, with nonstop innovation in \nnew business applications. AI models have moved \nbeyond small-scale customization and are now seeing \nmassive development on an industrial level. Looking \nahead, it's clear that digitalization, intelligence, and \ndecarbonation are the path forward. An intelligent \nworld is coming fast, and it will bring countless new \nopportunities for the ICT industry.\nOpen innovation is critical for social development and \ntechnological progress, and it's built into Huawei's \nvery DNA. We are actively working with other industry \nplayers and academia to advance technology and help \ndifferent industries modernize.\nHuawei has built up an extensive range of ICT \ntechnologies, and we will continue to invest heavily \nin R&D while strengthening strategic synergy across \nhardware, software, chips, devices, networks, and cloud.\nDespite a number of immense challenges over the past \nthree years, we continue to innovate based on two \ncore drivers: science and technology, and customer \nneeds. Throughout this time, we have invested over \n20% of our annual revenue back into R&D to ensure \nthe competitiveness of our products and solutions.\nTo meet industry demand for green transition, for \nexample, we recently launched a \"0 Bit 0 Watt\" \nwireless solution, which helps carriers strike the \noptimal balance between mobile network experience \nand energy consumption.\nHuawei Cloud's Pangu-Weather model is another \ngreat example. Featured in Nature , Pangu-Weather is \nthe world's first AI model that delivers more accurate \nweather forecasts than traditional numerical prediction \nmethods.Huawei's foundational software, including openEuler \nand GaussDB, has also seen broad application in \nmultiple industries.\nThese are all the result of innovation between Huawei, \ndifferent industries, and the academic community.\nPlatform capabilities for thriving \necosystems\nTrees need deep roots to grow a dense canopy \nof leaves. Likewise, our industry needs the active \nparticipation of many partners and developers in order \nto thrive.\nAt Huawei, ecosystem development is a key long-\nterm strategy. We advocate for open collaboration \nand helping others succeed. With this approach, we \nfocus on developing core ICT technologies, as well as \nbuilding up platform capabilities for complex hardware \nand sophisticated software, which we then open up to \nour partners to promote shared success.\nWe have fostered a robust device ecosystem based on \nHarmonyOS and Kirin, a general computing ecosystem \nbased on openEuler and Kunpeng, an AI computing \necosystem based on CANN and Ascend, and a \nmultiplatform developer ecosystem with Huawei Cloud \nas a unified portal.\nTo date, HarmonyOS has been deployed on more than \n800 million devices, and more than 6,300 partners \nhave joined our computing ecosystems. Among these, \nthe Ascend-based AI computing ecosystem has grown \nparticularly fast. We look forward to joining forces with \nother industry players to drive large-scale adoption \nof these technologies, optimize them, and move the \nindustry forward.\nAs for the developer ecosystem, we have attracted more \nthan 9.5 million developers to HarmonyOS, Kunpeng, \nAscend, and Huawei Cloud. We provide a rich array \nof development tools on Huawei Cloud, making it \neasier for application, operating system, and database \ndevelopers to do what they do best. The end goal is to \nstimulate innovation across the entire ecosystem."
    },
    {
        "question_1": "What was Apple Inc.'s net income in the twelve months ended September 30, 2023?",
        "answer_1": "$96,995 million",
        "question_2": "How much did Apple Inc. spend on repurchases of common stock in the twelve months ended September 30, 2023?",
        "answer_2": "$77,550 million",
        "question_3": "What was the total net sales for Apple Inc. in the twelve months ended September 30, 2023?",
        "answer_3": "$383,285 million",
        "filename": "./docs\\FY23_Q4_Consolidated_Financial_Statements.pdf",
        "first_5_page_texts": "  \n Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF OPERATIONS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and per-share amounts)  Three Months Ended  Twelve Months Ended  September 30, 2023  September 24, 2022  September 30, 2023  September 24, 2022 Net sales:           Products /dollarsign 67,184   /dollarsign 70,958   /dollarsign 298,085   /dollarsign 316,199     Services  22,314    19,188    85,200    78,129  Total net sales (1)  89,498    90,146    383,285    394,328  Cost of sales:           Products  42,586    46,387    189,282    201,471     Services  6,485    5,664    24,855    22,075  Total cost of sales  49,071    52,051    214,137    223,546  Gross margin  40,427    38,095    169,148    170,782          Operating expenses:        Research and development  7,307    6,761    29,915    26,251  Selling, general and administrative  6,151    6,440    24,932    25,094  Total operating expenses  13,458    13,201    54,847    51,345          Operating income  26,969    24,894    114,301    119,437  Other income/(expense), net  29    (237)   (565)   (334) Income before provision for income taxes  26,998    24,657    113,736    119,103  Provision for income taxes  4,042    3,936    16,741    19,300  Net income /dollarsign 22,956   /dollarsign 20,721   /dollarsign 96,995   /dollarsign 99,803          Earnings per share:        Basic /dollarsign 1.47   /dollarsign 1.29   /dollarsign 6.16   /dollarsign 6.15  Diluted /dollarsign 1.46   /dollarsign 1.29   /dollarsign 6.13   /dollarsign 6.11  Shares used in computing earnings per share:        Basic  15,599,434    16,030,382    15,744,231    16,215,963  Diluted  15,672,400    16,118,465    15,812,547    16,325,819          (1) Net sales by reportable segment:        Americas /dollarsign 40,115   /dollarsign 39,808   /dollarsign 162,560   /dollarsign 169,658  Europe  22,463    22,795    94,294    95,118  Greater China  15,084    15,470    72,559    74,200  Japan  5,505    5,700    24,257    25,977  Rest of Asia Pacific  6,331    6,373    29,615    29,375  Total net sales /dollarsign 89,498   /dollarsign 90,146   /dollarsign 383,285   /dollarsign 394,328          (1) Net sales by category:        iPhone /dollarsign 43,805   /dollarsign 42,626   /dollarsign 200,583   /dollarsign 205,489  Mac  7,614    11,508    29,357    40,177  iPad  6,443    7,174    28,300    29,292  Wearables, Home and Accessories  9,322    9,650    39,845    41,241  Services  22,314    19,188    85,200    78,129  Total net sales /dollarsign 89,498   /dollarsign 90,146   /dollarsign 383,285   /dollarsign 394,328    \n Apple Inc. CONDENSED CONSOLIDATED BALANCE SHEETS (Unaudited) (In millions, except number of shares, which are reflected in thousands, and par value)   September 30, 2023  September 24, 2022 ASSETS: Current assets:    Cash and cash equivalents /dollarsign 29,965   /dollarsign 23,646  Marketable securities  31,590    24,658  Accounts receivable, net  29,508    28,184  Vendor non-trade receivables  31,477    32,748  Inventories  6,331    4,946  Other current assets  14,695    21,223  Total current assets  143,566    135,405      Non-current assets:    Marketable securities  100,544    120,805  Property, plant and equipment, net  43,715    42,117  Other non-current assets  64,758    54,428  Total non-current assets  209,017    217,350  Total assets /dollarsign 352,583   /dollarsign 352,755      LIABILITIES AND SHAREHOLDERS’ EQUITY: Current liabilities:    Accounts payable /dollarsign 62,611   /dollarsign 64,115  Other current liabilities  58,829    60,845  Deferred revenue  8,061    7,912  Commercial paper  5,985    9,982  Term debt  9,822    11,128  Total current liabilities  145,308    153,982      Non-current liabilities:    Term debt  95,281    98,959  Other non-current liabilities  49,848    49,142  Total non-current liabilities  145,129    148,101  Total liabilities  290,437    302,083      Commitments and contingencies        Shareholders’ equity:    Common stock and additional paid-in capital, /dollarsign0.00001 par value: 50,400,000 shares authorized; 15,550,061 and 15,943,425 shares issued and outstanding, respectively  73,812    64,849  Accumulated deficit  (214)   (3,068) Accumulated other comprehensive loss  (11,452)   (11,109) Total shareholders’ equity  62,146    50,672  Total liabilities and shareholders’ equity /dollarsign 352,583   /dollarsign 352,755     \n Apple Inc. CONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS (Unaudited) (In millions)   Twelve Months Ended  September 30, 2023  September 24, 2022 Cash, cash equivalents and restricted cash, beginning balances /dollarsign 24,977   /dollarsign 35,929      Operating activities:    Net income  96,995    99,803  Adjustments to reconcile net income to cash generated by operating activities:    Depreciation and amortization  11,519    11,104  Share-based compensation expense  10,833    9,038  Other  (2,227)   1,006  Changes in operating assets and liabilities:    Accounts receivable, net  (1,688)   (1,823) Vendor non-trade receivables  1,271    (7,520) Inventories  (1,618)   1,484  Other current and non-current assets  (5,684)   (6,499) Accounts payable  (1,889)   9,448  Other current and non-current liabilities  3,031    6,110  Cash generated by operating activities  110,543    122,151      Investing activities:    Purchases of marketable securities  (29,513)   (76,923) Proceeds from maturities of marketable securities  39,686    29,917  Proceeds from sales of marketable securities  5,828    37,446  Payments for acquisition of property, plant and equipment  (10,959)   (10,708) Other  (1,337)   (2,086) Cash generated by/(used in) investing activities  3,705    (22,354)     Financing activities:    Payments for taxes related to net share settlement of equity awards  (5,431)   (6,223) Payments for dividends and dividend equivalents  (15,025)   (14,841) Repurchases of common stock  (77,550)   (89,402) Proceeds from issuance of term debt, net  5,228    5,465  Repayments of term debt  (11,151)   (9,543) Proceeds from/(Repayments of) commercial paper, net  (3,978)   3,955  Other  (581)   (160) Cash used in financing activities  (108,488)   (110,749)     Increase/(Decrease) in cash, cash equivalents and restricted cash  5,760    (10,952) Cash, cash equivalents and restricted cash, ending balances /dollarsign 30,737   /dollarsign 24,977      Supplemental cash flow disclosure:    Cash paid for income taxes, net /dollarsign 18,679   /dollarsign 19,573  Cash paid for interest /dollarsign 3,803   /dollarsign 2,865   "
    },
    {
        "question_1": "What was Huawei's revenue in 2021?",
        "answer_1": "CNY636.8 billion",
        "question_2": "How much did Huawei invest in R&D in 2021?",
        "answer_2": "CNY142.7 billion",
        "question_3": "What was Huawei's net profit margin in 2021?",
        "answer_3": "17.9%",
        "filename": "./docs\\HW_annual_report_2021_en.pdf",
        "first_5_page_texts": "2021 Who is Huawei?\nFounded in 1987, Huawei is \na leading global provider of \ninformation and communications \ntechnology (ICT) infrastructure \nand smart devices. We have \n195,000 employees and we \noperate in over 170 countries and \nregions, serving more than three \nbillion people around the world. \nWe are committed to bringing \ndigital to every person, home and \norganization for a fully connected, \nintelligent world. Together, we’re building for tomorrow\nTogether, we’re laying the foundation of the digital economy and \nhelping all industries go digital. Throughout 2021, many countries \nturned to digital transformation and the digital economy to more \neffectively fight the pandemic, increase social resilience, and promote \neconomic recovery. This has increased the need for joint effort in areas like \nindustry policy, cross-sector collaboration, and innovation.\nAt Huawei, we provide a broad range of ICT capabilities to help all \nindustries go digital. Through continuous innovation, we help industries \ndigitalize their supply chains to more effectively cope with challenges \ncaused by the pandemic. We firmly support free trade, open markets, \nand fair competition – especially the free trade of tech products. We are \ndoing everything we can to drive the healthy development of global supply \nchains.\nTogether, we’re building a low-carbon world and promoting \nsustainable development. Climate change has become a formidable \nroadblock to our ongoing development as a society. Now more than ever, \nwe need to reassess our relationship with nature and move faster towards \nlow-carbon development and green growth models. Carbon neutrality has \nbecome a globally recognized mission.\nHuawei is doing its part to contribute to a greener and more sustainable \ndigital world. Together with our customers and partners, we use innovative \ntechnologies to cut carbon emissions, promote renewable energy, and \ncontribute to a circular economy.\nTogether, we’re addressing new challenges in cyber security and \nprivacy protection. While it’s true that digital technology has greatly \nimproved people’s lives and fueled economic growth, challenges in cyber \nsecurity and privacy protection are also on the rise. Addressing these \nchallenges is our top priority. We are working tirelessly to develop secure, \ntrustworthy, and quality products, solutions, and services to help our \ncustomers build more resilient networks.For more than 30 years, we have worked closely \nwith our carrier customers to build over 1,500 \nnetworks in more than 170 countries and \nregions. We are helping millions of companies go \ndigital. Together, we have connected more than \nthree billion people around the world and have \nmaintained a solid track record in security.\nMoving forward, Huawei will continue to engage \nand work with all stakeholders in an open, \ntransparent, and responsible manner. Together, \nwe can more effectively address cyber security and \nprivacy protection challenges through innovative \ntechnology, shared standards, certification, and \nimproved governance. We will continue working \nhard to enhance cyber security and protect \npersonal privacy while people enjoy the benefits \nof digital technology.\nWe’re working together with people around \nthe world to explore the future. A changing \nexternal environment will not cause us to stray \nfrom our ideals or aspirations. Global integration \nand economies of scale will make the whole world \nmore efficient. To benefit from this, we need to \nwork together more openly, sharing both the risks \nand value created by our efforts. This is the only \npath to shared progress and prosperity.\nAs a tech company, one of our greatest social \nresponsibilities is exploring the future. We will \nspare no effort as we probe the endless frontiers \nof science and technology. We will join forces with \npeople from around the world to break through \nengineering bottlenecks and limits in fundamental \ntheories. We are committed to bringing ICT \ntechnology to each and every industry, to creating \nnew value by helping them go digital, intelligent, \nand green, and to helping them cut their energy \nconsumption and go low-carbon. Our ultimate \ngoal is to bring the benefits of technology to \neveryone.Message from the Rotating Chairman\nBusiness Highlights in 2021\nFive-Year Financial Highlights\nMessage from the Chairman02\n07\n09\n10\n152\n164\n167\n18814\n18\n97\n98\n149Industry Trends\nManagement Discussion and Analysis\nIndependent Auditors’ Report\nConsolidated Financial Statements \nSummary\nRisk Factors\nCorporate Governance Report\nCreating Social Value\nSustainable Development\nAbbreviations, Financial Terminology, \nand Exchange RatesContents02       Huawei Investment & Holding Co., Ltd.Message from the Rotating Chairman\nOver the past three years, an extremely challenging \nbusiness environment – not to mention substantial \nnonmarket factors – have complicated our business \noperations.\nAnd yet when the storm came, we chose to run \nheadfirst into the rain. We have done everything in \nour capacity to ensure business continuity, with no \ninterruptions in delivery or service. We have been \nworking day and night to grow the harvest and secure \nour survival. The pouring rain hasn’t extinguished our \nfaith in what the future holds. Quite the opposite: \nWe’re more dedicated and innovative than ever.\nWhile many have been watching to see whether \nHuawei might fall, we’ve maintained focus on creating \nvalue for our customers and working together with \nour ecosystem partners to foster shared success. We \nhave kept plugging away, improving the quality of our \noperations and investing in the future.\nWe could not have achieved any of this without the \nongoing trust and support of our customers, partners, \nand friends from all over the world. You have given \nus the foothold and the confidence we need to keep \nclimbing. On behalf of everyone at Huawei, thank you \nfor sticking by our side.Moving forward, Huawei will advance \nits journey of digitalization, intelligent \ntransformation, and low carbon. We \nwill continuously increase investment in \ntalent, scientific research, and innovation, \nin an effort to reshape our foundational \ntechnologies. Building on this, we will bring \ntogether ICT technologies and our global \nexperience to drive digital transformation \nacross different industries, and create greater \nvalue for both our customers and society at \nlarge.2021 Annual Report         03Solid financial results, increased \noperating efficiency, and healthy \nbusiness development\nIn 2021, our revenue reached CNY636.8 billion, \nwrapping up the year in a solid financial position. \nOverall, our performance was in line with forecast. \nOur carrier business remained stable, our enterprise \nbusiness experienced steady growth, and our consumer \nbusiness quickly expanded into new domains.\nIn 2021, Huawei generated a net profit of CNY113.7 \nbillion with a net margin of 17.9%. Cash flow from \noperating activities grew by 69.4%, and we now have \nplenty of cash on hand. Our liability ratio dropped \nfrom 62.3% in 2020 to 57.8% in 2021, further \nimproving our capital structure. By streamlining \nmanagement and making full use of digital \ntechnology, we’ve made ongoing improvements to \noperating efficiency, ultimately reducing selling and \nadministrative expenses by CNY9.3 billion.\nThe harder things get, the more we invest in the \nfuture. In 2021, we increased our R&D investment \nto CNY142.7 billion, representing 22.4% of our total \nrevenue. Both our R&D expenses and R&D expense \nratio reached their highest levels in the past ten years. \nIn terms of R&D expenditure, Huawei ranked second in \nthe 2021 EU Industrial R&D Investment Scoreboard.\nIn 2021, we worked with carriers and partners around \nthe world to create simplified, green, and intelligent \nICT infrastructure. Test results show that 5G networks \nbuilt by Huawei for customers in 13 countries provide \nthe best user experience. To date, we have advanced \nover 3,000 industrial 5G applications, and have worked \nwith carriers in over 100 countries and regions to build \ngreen sites.\nIn 2021, we launched 11 scenario-based solutions \nfor key sectors such as government, transportation, \nfinance, energy, and manufacturing. We established \nmultiple integrated teams, including a Coal Mine \nTeam, a Smart Road Team, and a Customs & Port \nTeam, to combine resources in a way that more \nefficiently serves the needs of our customers. Over 700 \ncities and 267 Fortune Global 500 companies have \nchosen Huawei as their digital transformation partner, \nand we now work with more than 6,000 service and \noperation partners around the world.Our consumer business zeroed in on consumer wants \nand needs, further building out the global ecosystem \nfor a smart, all-connected era. We continued to \nsee steady sales growth in smart wearables, smart \nscreens, true wireless stereo (TWS) earbuds, and \nHuawei Mobile Services (HMS) throughout the year. \nIn total, HarmonyOS was used in over 220 million \nHuawei devices. We enhanced our brand marketing, \nchannel sales, retail, and service capabilities based \non our “1 + 8 + N” Seamless AI Life strategy, which \nhas allowed us to expand into new domains while \nspeeding up our strategic transition.\nFor Digital Power, we worked with customers and \npartners worldwide to build low-carbon communities \nwith ongoing innovation in domains like clean power \ngeneration, energy digitalization, transportation \nelectrification, green ICT power infrastructure, and \nintegrated smart energy. In total, our digital power \nsolutions helped customers generate 482.9 billion kWh \nof renewable electricity and save 14.2 billion kWh of \nelectricity. These efforts resulted in a reduction of \nnearly 230 million tons in CO 2 emissions.\nBy diving into digitalization, our cloud business made \nsolid progress towards “delivering everything as a \nservice”. With Infrastructure as a Service (IaaS), we \nhelp enterprises expand their services to all four \ncorners of the earth. With Technology as a Service \n(TaaS), we provide the fruits of our R&D efforts in \nthe form of cloud services, making innovation easier \nthan ever. With Expertise as a Service (EaaS), we help \ndevelopers incorporate industry best practices into \ntheir own solutions. To date, we have launched more \nthan 50 scenario-based cloud services and provided \ncustomers with more than 8,000 scenario-based \nsolutions. To date, more than 2.6 million developers \nhave joined the Huawei Developer Program. Together, \nwe remain committed to providing stable, reliable, \nsecure, trustworthy, and innovative cloud services to \nour customers.\nOur Intelligent Automotive Solution business aims to \nserve our customers and partners with high-quality \nproducts. By the end of 2021, we launched more than \n30 intelligent automotive components, bringing new \ninnovation to the industry. We work with car OEMs \nusing models like Huawei HI and Huawei Zhixuan. \nAs always, Huawei does not make cars. We help car \nOEMs build better cars – and sell more of them."
    },
    {
        "question_1": "When was Huawei founded?",
        "answer_1": "1987",
        "question_2": "How many employees does Huawei have?",
        "answer_2": "207,000",
        "question_3": "How many cyber security standards proposals did Huawei submit in 2022?",
        "answer_3": "Nearly 300",
        "filename": "./docs\\HW_annual_report_2022_en.pdf",
        "first_5_page_texts": "2022Who is Huawei?\nFounded in 1987, Huawei is \na leading global provider of \ninformation and communications \ntechnology (ICT) infrastructure \nand smart devices. We have \n207,000 employees and operate \nin over 170 countries and regions, \nserving more than three billion \npeople around the world. We are \ncommitted to bringing digital \nto every person, home and \norganization for a fully connected, \nintelligent world.Together, we’re building for tomorrow\nTogether, we’re laying the foundations for the digital economy \nand helping all industries go digital. As countries around the \nworld buckle down for post-pandemic recovery, many have turned \nto digitalization and the digital economy to address socioeconomic \nchallenges. And the results are clear: Throughout 2022, we have \nseen a marked increase in the adoption of digital technology and \nservices among governments, industry organizations, enterprises, and \nconsumers.\nThe world is going digital more rapidly than ever before. And as \nthis trend gains steam, we’re innovating nonstop to bring the best \nof digital technology and services to organizations of all shapes and \nsizes, helping drive the digital transformation of all industries.\nTogether, we’re enabling green development and building a \nbetter planet with technology. Climate change has become a \nformidable roadblock to long-term development and well-being. Now \nmore than ever, we need to reassess our relationship with nature \nand move faster towards low-carbon and green development models. \nCarbon neutrality has become a globally recognized mission.\nWe believe that technology can help make our planet a better \nplace. Huawei is doing its part to contribute to a greener and more \nsustainable digital world. Together with our customers and partners, \nwe use innovative technology to expand the carbon handprint of the \nICT industry, reduce carbon emissions, promote renewable energy, \nand foster a more circular economy.\nTogether, we’re strengthening cyber security and privacy \nprotection for enhanced security and trustworthiness. Network \ninfrastructure is growing and improving every day, laying the \nfoundations for a booming digital economy. While this opens up \nnew possibilities in the digital world, challenges in cyber security and \nprivacy protection are also on the rise. Addressing these challenges \nis an ongoing process, one that requires concerted effort from all \nstakeholders.\nCyber security and privacy protection are Huawei’s top priorities, \ncommitments that are above and beyond any commercial interests. \nWe continue to maintain a solid track record in cyber security, and our efforts have earned widespread recognition in over 170 markets \naround the world, where we serve more than three billion people. \nCustomer trust is the most solid testament to the security and quality \nof Huawei’s products and services.\nOn the industry front, Huawei firmly believes that openness and \ncollaboration lead to shared success. We actively engage with the ICT \nindustry, working with our peers and industry stakeholders to share \nbest practices in cyber security and privacy protection. In 2022, we \nsubmitted nearly 300 cyber security standards proposals to 3GPP and \nGSMA. Working side-by-side with stakeholders all along the value \nchain, we are innovating together to bolster the industry’s cyber \nsecurity and privacy protection capabilities. Together, we are building \na more secure digital world.\nTogether, we are cultivating digital talent to bridge the digital \ndivide. Digital talent plays an instrumental role in driving digital \ntransformation and unleashing digital productivity. We’re working \nhard to build digital skills in the countries and regions where we \noperate. Back in 2008, Huawei launched a program called Seeds for \nthe Future to help universities foster the next generation of digital \ntalent. Through this program, we’re also helping upskill industry and \npublic sector professionals and nurture new tech leadership, working \nwith local communities to build basic digital skills, and inspiring \npeople to tackle real-world challenges in tech competitions. To date, \nthis program has benefited more than 2.43 million people from over \n150 countries.\nWe’re working together to explore the future. We firmly \nsupport free trade, open markets, and fair competition. We’re doing \neverything we can to drive the healthy development of global supply \nchains, especially in ICT. The world is changing, but our ideals and \naspirations remain firm. Global integration and economies of scale \nmake the whole world more efficient. To benefit from this, we need \nto work together more openly, sharing both the risks and value \ncreated by our efforts. This is the only path to shared progress and \nprosperity.\nAs a tech company, one of our greatest social responsibilities is \nexploring the future. We will spare no effort as we probe the endless \nfrontiers of science and technology. We will join forces with people \nfrom around the world to break through engineering bottlenecks \nand limits in fundamental theories. We are committed to bringing \nICT technology to each and every industry, to creating new value \nby helping them go digital, intelligent, and green, and to helping \norganizations cut their energy consumption and go low-carbon. Our \nultimate goal is to bring the benefits of technology to everyone.Contents\nMessage from the Rotating Chairman\nBusiness Highlights in 2022\nFive-Year Financial Highlights\nMessage from the Chairman02\n05\n07\n08\n12\n17\n93\n94\n138Industry Trends\nManagement Discussion and Analysis\nIndependent Auditors’ Report\n Consolidated Financial Statements  \nSummary\nRisk Factors\n141\n158\n175Corporate Governance Report\nSustainable Development\n Abbreviations, Financial Terminology,  \nand Exchange Rates\n02       Huawei Investment & Holding Co., Ltd.\nMessage from the Rotating ChairmanA challenging external environment and non-market \nfactors continue to take a toll on Huawei’s operations. \nIn the midst of this storm, we have kept racing ahead, \ndoing everything in our power to maintain business \ncontinuity and serve our customers. We have also gone \nto great lengths to grow the harvest – generating a \nsteady stream of revenue to sustain our survival and \nlay the groundwork for future development.\nThe strength of pines is most pronounced in the \ndepths of winter, as are the ties that bind us. Huawei \nwould not have been able to weather such extreme \ndifficulties without the tremendous trust and support \nof our customers and partners. For this, we are forever \ngrateful.\nWe are also immensely proud of the Huawei team: \nWe’ve managed to keep our heads above the water \nbecause we fought together, united as one. This is Plum blossoms tend to grow sweeter \nfrom a harsh winter ’s freeze. Today, \nHuawei is like a plum blossom. While \nit’s true that we have considerable \npressure ahead of us, we have what \nit takes to come out the other end – \nwith opportunities to grow, a resilient \nbusiness portfolio, a unique competitive \nedge, the enduring trust of our customers \nand partners, and the courage to invest \nheavily in R&D. We are conﬁdent in our \nability to rise above any challenge that \ncomes our way, laying a solid foundation \nfor sustainable survival and development.\nespecially true of our frontline staff outside of China – \nthose who have held the fort to serve our customers \ndespite the adverse impacts of COVID-19 and external \nrestrictions. And of course, we wouldn’t be where we \nare today without the unfailing support of our families \nand loved ones as well. They’re our rocks, and we are \nfortunate to have them at our back.\nOn behalf of the company, I’d like to express our \nsincere gratitude to all of you.\nThe macro environment may be rife with uncertainty, \nbut what we can be certain about is that digitalization \nand decarbonization are the way forward, and they \nare where future opportunities lie. Faced with external \nvolatility, we need to remain focused and stay true to \nour vision and mission. We need to double down on \nour commitment to building the foundations of the \ndigital economy and to driving green and sustainable \n2022 Annual Report        03development. By doing this, we can create greater \nvalue for our customers, partners, and society at large.\n2023 will be crucial to Huawei’s sustainable survival \nand development. We need to actively drive progress, \nkeep inspiring passion across the organization, and \nfurther hone our capabilities. We need to be proactive \nabout improving the business environment and more \neffectively managing risks. This is the only way we can \nlay a solid foundation for Huawei’s future.\nHelping industries go digital, \nintelligent, and green to unlock new \ngrowth opportunities\nCountries around the world have turned to developing \ntheir digital economy as a key counterweight against \neconomic downturn. By 2027, a growing digital \neconomy will open up trillion-dollar addressable \nmarkets for our company. Naturally, countries at \ndifferent stages of development will choose different \npaths as they build up their digital economy, just as \ndifferent industries and organizations will choose the \npath that works best for their digital journey. In some \ncases, opting for the most advanced technology is not \nnecessarily the best solution.\nAt Huawei, we put customers’ needs front and center, \nproviding them with the right technology for the \nright scenario, at the right time and with the right \nmodel, following the shortest route to market. For \nthis purpose, we have established multiple integrated \nteams for specific industries, including finance, mining, \ngovernment public services, transportation (airports, \nrails, roads, waterway, and ports), and electric power. \nWe aim to become the preferred partner for industries \nas they go digital, intelligent, and green – and in \ndoing so, we can pave the way for our own long-term \ngrowth, too.\nOptimizing our business portfolio to \nenhance resilience\nWe continue to optimize our business portfolio, \nwhich now covers a mix of ICT infrastructure, smart \ndevices, Huawei Cloud, digital power, and intelligent \nautomotive solutions, backed by technological support platforms like our 2012 Laboratories and HiSilicon. \nThis portfolio includes a mix of our well-established \nbusiness domains and a handful of more pioneering \ndomains. Some are developing stably while others \nare growing rapidly. Some rely on advanced process \ntechnology and others don’t. Some are hardware-\ncentric while others are software-centric. Together, \nthey constitute a resilient business portfolio in terms \nof both structure and potential, forming a solid basis \nfor Huawei’s sustainable survival and development.\nStrengthening synergy between \nchips, software, hardware, devices, \nnetworks, and clouds to hone our \nunique competitive edge\nThrough years of concerted effort, we have built \nrelatively strong competitiveness in our business \ndomains, and we have good reason to believe \nwe’ll maintain this edge for the foreseeable future. \nBut given our inability to access advanced process \ntechnology, we need to keep exploring ways to \nfurther enhance the long-term competitiveness of \nour products and services.\nHuawei has the most comprehensive set of \ntechnologies in ICT, and this is our unique advantage. \nMoving forward, we will step up integrated innovation \nacross tech domains – namely chips, software, \nhardware, devices, networks, and clouds – to ensure \nevery bit of data can be collected, transmitted, \nprocessed, and presented in an optimal way. \nDelivering the simplest possible architecture, highest \npossible quality, lowest possible costs, and a superior \nexperience is our goal.\nWe are working hard to optimize network \nperformance, energy consumption, cloud resource \nutilization, cloud application performance, O&M \nefficiency, and service capabilities. And we will \ncontinue to optimize user experience for devices and \nintelligent vehicles. In these ways and more, we are \ncreating new value for our customers. And it’s through \nthese efforts that we will keep honing our competitive \nedge, bolstering the leadership of our products and \nsolutions well into the future."
    },
    {
        "question_1": "What was the global comparable sales growth percentage for McDonald's in the last year?",
        "answer_1": "9%",
        "question_2": "How many active loyalty users did McDonald's have by the end of 2023?",
        "answer_2": "150 million",
        "question_3": "By the end of 2027, how many restaurants worldwide does McDonald's plan to have?",
        "answer_3": "50,000",
        "filename": "./docs\\McDonald 2023 Annual Report_vf.pdf",
        "first_5_page_texts": "Annual ReportA Year Powered by Strength and Resilience\nThank You\nof the entire McDonald’s System — over two million \ncrew members, the industry’s best franchisees, and our network of global suppliers — backed by a talented senior leadership team, dedicated Board of Directors and standout growth strategy, Accelerating the Arches.  \nOne constant throughout my tenure as CEO has been \nour Chairman Rick Hernandez, who recently announced his retirement. Having joined the Board in 1996, Rick served for many years alongside one of our founders, Fred Turner. And like Fred, Rick truly carries “ketchup  in his veins.”  \nRick’s support and guidance were critical to me as \nI assumed the CEO role unexpectedly, and then quickly had to navigate the Company through a global pandemic and geopolitical crises. I am grateful for his leadership. \nRick’s unwavering commitment to the McDonald’s \nSystem has been instrumental to the growth of our Brand. I look forward to carrying forward his devotion to McDonald’s as I assume the role of Chairman following our Annual Shareholders’ Meeting, working closely with Lead Independent Director Miles White. In today’s dynamic and challenging landscape, the power of one company voice is essential to our three-legged stool’s continued strength. \nThanks to our restless ambition, we are operating from a position of strength.  \nThat’s one of the things I love about McDonald’s. \nWe’re always innovating and pushing for the highest standards. It’s why we continue to lead the industry after almost 70 years.  \nThis past year, we continued evolving as we worked \nto meet the heightened expectations of our customers, employees, and stakeholders. We’re doing so much more than navigating a challenging operating environment, we’re leading through  it — as we always have. \nI think it’s fair to say that our secret sauce lies in a \npowerful combination: the tireless dedication\nDear Shareholders,  \nGlobal McFamily  Members, and  Customers,\nAnnual Letter to ShareholdersIn 2023, we pushed ourselves even further in \nservice to our customers and communities, and towards our goal of delivering enduring, profitable growth for our shareholders. As a result, global comparable sales grew by 9% and guest counts grew by 3% globally last year. \nUnderpinning our momentum was the evolution \nof our Accelerating the Arches strategy. The beauty and power of Accelerating the Arches is that it’s designed to be evolutionary, and our M-C-D growth pillars have demonstrated how we can adjust to changing needs.  \nOur world-class, culturally relevant Marketing (“M”) \nand creative campaigns are keeping the brand front-of-mind and driving performance — from the viral Grimace shake to Raise Your Arches to our 1-in-8 campaign, and our McDonald’s x Crocs collab supporting Ronald McDonald House Charities®. \nWe’ve continued to build affinity with our Core \n(“C”) menu classics, leaning into the power of iconic favorites to drive customer demand while simplifying operations. We continue to make our core menu even more enticing with initiatives like Best Burger that incorporate changes to cooking procedures for our iconic Hamburger, Cheeseburger and Big Mac ®. The result is a hotter, \njuicier burger, and customers tell us that they can taste a big difference. Cementing our Position as  \none of the World’s Leading  Consumer Brands intuitive technology that reduces complexity \nand makes it easier to deliver the memorable experience our customers expect. Not only does cutting-edge technology make operations more efficient, stable, and reliable, it also instills a greater sense of pride and is key to providing the best experience for restaurant teams. \nFinally, we are building a modern company \nplatform with an emphasis on new capabilities that makes McDonald’s a better partner for franchisees and suppliers alike. We organized Company employees around a structure  that’s fit for purpose as part of Accelerating the Organization. Greater efficiencies are unlocking faster speed-to-market and creating even more exciting career opportunities. \nThese platforms will create a step change to our \nsales and margin trajectory, slowly at first, but with increasing speed and impact.  McDonald’s size and scale are unmatched competitive advantages. I believe the benefits they yield — paired with McDonald’s innovative spirit — will only become more pronounced in 2024 and the years ahead. As we shared at our Investor Update at the end of 2023,We also identified significant opportunities to drive \nfuture growth, like we’re doing in the large burger category. We’ll be testing this concept in three markets later this year. At the same time, we’ve made impressive strides towards developing a reputation for great chicken. Chicken now represents over $25 billion in annual Systemwide sales — that’s on par with our beef business — and we’ve established McCrispy® and McSpicy® as new global core menu items alongside McNuggets® and McChicken®. \nFinally, we’ve added a fourth “D,” Development, as \nwe continue to double down on Digital, Delivery, and Drive-Thru. Our 4 “Ds” take what customers love about McDonald’s — from convenience to value to personal connections with our brand — and make them even better. T oday, there are more than 40,000 restaurants across the globe, and over the past four years, we’ve added nearly $30 billion in Systemwide sales to our business. By the end of 2027, we plan to expand the McDonald’s footprint to 50,000 restaurants worldwide, fueling Systemwide sales growth with strong contributions to the bottom line.  \nwe have even greater ambitions for the  future — ambitions that will cement McDonald’s  as one of the world’s leading consumer brands.  \nWe’re creating a consumer platform that  \nreimagines the customer experience and fuels profitable customer engagement in a targeted and personalized way. Aggressive investments in digital and technology have enabled us to build one of the world’s largest loyalty programs. By the end of 2023, we were connecting with 150 million active loyalty users across 50 markets. Over the next four years, we plan to expand our reach with loyalty to 250 million active loyalty users. \nWe’re also introducing the easiest and most \nefficient restaurant platform. This is all about our commitment to being the best franchisor, and equipping franchisees to run great restaurants. We’re committed to equipping the 2 million+ employees in McDonald’s restaurants with\n“We have even  \ngreater ambitions for our future.”Annual Letter to Shareholders\nCreating Genuine, Lifelong  \nEmotional Connections  with our BrandAnnual Letter to ShareholdersIn 2023, we pushed ourselves even further in \nservice to our customers and communities, and towards our goal of delivering enduring, profitable growth for our shareholders. As a result, global comparable sales grew by 9% and guest counts grew by 3% globally last year. \nUnderpinning our momentum was the evolution \nof our Accelerating the Arches strategy. The beauty and power of Accelerating the Arches is that it’s designed to be evolutionary, and our M-C-D growth pillars have demonstrated how we can adjust to changing needs.  \nOur world-class, culturally relevant Marketing (“M”) \nand creative campaigns are keeping the brand front-of-mind and driving performance — from the viral Grimace shake to Raise Your Arches to our 1-in-8 campaign, and our McDonald’s x Crocs collab supporting Ronald McDonald House Charities®. \nWe’ve continued to build affinity with our Core \n(“C”) menu classics, leaning into the power of iconic favorites to drive customer demand while simplifying operations. We continue to make our core menu even more enticing with initiatives like Best Burger that incorporate changes to cooking procedures for our iconic Hamburger, Cheeseburger and Big Mac ®. The result is a hotter, \njuicier burger, and customers tell us that they can taste a big difference. Cementing our Position as  \none of the World’s Leading  Consumer Brands intuitive technology that reduces complexity \nand makes it easier to deliver the memorable experience our customers expect. Not only does cutting-edge technology make operations more efficient, stable, and reliable, it also instills a greater sense of pride and is key to providing the best experience for restaurant teams. \nFinally, we are building a modern company \nplatform with an emphasis on new capabilities that makes McDonald’s a better partner for franchisees and suppliers alike. We organized Company employees around a structure  that’s fit for purpose as part of Accelerating the Organization. Greater efficiencies are unlocking faster speed-to-market and creating even more exciting career opportunities. \nThese platforms will create a step change to our \nsales and margin trajectory, slowly at first, but with increasing speed and impact.  McDonald’s size and scale are unmatched competitive advantages. I believe the benefits they yield — paired with McDonald’s innovative spirit — will only become more pronounced in 2024 and the years ahead. As we shared at our Investor Update at the end of 2023,We also identified significant opportunities to drive \nfuture growth, like we’re doing in the large burger category. We’ll be testing this concept in three markets later this year. At the same time, we’ve made impressive strides towards developing a reputation for great chicken. Chicken now represents over $25 billion in annual Systemwide sales — that’s on par with our beef business — and we’ve established McCrispy® and McSpicy® as new global core menu items alongside McNuggets® and McChicken®. \nFinally, we’ve added a fourth “D,” Development, as \nwe continue to double down on Digital, Delivery, and Drive-Thru. Our 4 “Ds” take what customers love about McDonald’s — from convenience to value to personal connections with our brand — and make them even better. T oday, there are more than 40,000 restaurants across the globe, and over the past four years, we’ve added nearly $30 billion in Systemwide sales to our business. By the end of 2027, we plan to expand the McDonald’s footprint to 50,000 restaurants worldwide, fueling Systemwide sales growth with strong contributions to the bottom line.  \nwe have even greater ambitions for the  future — ambitions that will cement McDonald’s  as one of the world’s leading consumer brands.  \nWe’re creating a consumer platform that  \nreimagines the customer experience and fuels profitable customer engagement in a targeted and personalized way. Aggressive investments in digital and technology have enabled us to build one of the world’s largest loyalty programs. By the end of 2023, we were connecting with 150 million active loyalty users across 50 markets. Over the next four years, we plan to expand our reach with loyalty to 250 million active loyalty users. \nWe’re also introducing the easiest and most \nefficient restaurant platform. This is all about our commitment to being the best franchisor, and equipping franchisees to run great restaurants. We’re committed to equipping the 2 million+ employees in McDonald’s restaurants with\n“We have even  \ngreater ambitions for our future.”Annual Letter to Shareholders\nCreating Genuine, Lifelong  \nEmotional Connections  with our BrandAnnual Letter to ShareholdersAcross the McDonald’s System, we’ll remain nimble as \nwe continue to deliver strong performance in today’s dynamic environment, while driving real impact in the communities we serve. \nWhen we mobilize the best of our innovation, \ncollaboration, and execution across the McDonald’s System, and when we use our size and scale to our advantage, we can do things that absolutely nobody else can do.  \nT ogether, we’ll continue to lead the industry — putting \nour values, purpose, and people at the center of everything we do — and building the engine that will power McDonald’s to unleash the full strength of our global scale. \nT ogether, we’ll drive sustainable and profitable growth, \nas we reimagine our future. \nThank you.\nChris Kempczinski \nPresident and CEO McDonald’s CorporationReimagining our  \nFuture, Together\nAnnual Letter to Shareholders"
    },
    {
        "question_1": "What is McDonald's global sales figure for 2021?",
        "question_2": "By what year does McDonald's commit to achieving net-zero emissions across its global operations?",
        "question_3": "How many loyalty members were enrolled in the U.S. six months after the launch?",
        "filename": "./docs\\McDonald MCD 2021 Annual Report.pdf",
        "first_5_page_texts": "22\n00\n1\nA year of resilience and great progress\nAnnual Report 22\nand translate it into meaningful experiences for  \nour customers, embodying our mission to  \nmake delicious, feel-good moments easy for  \neveryone. They bring our purpose to feed and foster  \ncommunities to life every second of the day. And  \nthey do this all with a grounding in both knowing  \ntheir communities and being good neighbors.  \nA little more than a year ago, I said that we  \nwere witnessing the beginning of the next great \nchapter at McDonald’s. There has never been  \na better time to be part of Brand McDonald’s than \nright now—and this past year showed what makes \nMcDonald’s unique: the strength of our people, \nthe scale of our supply chain, the agility of our \nSystem, the importance of local owners operating \nin the communities we serve, and the power of the \nMcDonald’s Brand.  \nThe best part of leading McDonald’s is the pride I \nfeel seeing the commitment of our System and the \nleadership of our restaurant managers and crews. \nThey take our strategy of Accelerating the Arches  \nDear Shareholders, \nthe Global McFamily, \nand our Customers,Annual Letter to Shareholders\nAlways guided by our purpose  \nto feed and foster communities \nMcDonald’s is part of the cultural fabric in \ncommunities around the world. That’s why it  \nis important that  Accelerating the Arches  is a  \nholistic strategy, integrating our business objectives \nand our responsibility to meet society’s evolving \nexpectations of modern businesses to make a \ndifference in the world. It is clear that this will be ever \nmore important in 2022, as we continue to support \ncommunities through the multitude of challenges \nthey face—whether the ongoing impacts of COVID-19  \nor the rapidly changing and devastating humanitarian \ncrisis in Ukraine and throughout Europe.1  Consists of both Company and franchise sales  \n2  Consists of both Company and franchise salesWe continued to meaningfully advance efforts  \nthat focused on our broader role in communities. \nThis includes our commitment to achieving net \nzero emissions across our global operations by \n2050, our progress to create more sustainable \nHappy Meal toys by the end of 2025, our $5 million \ncommitment with the NextGen Consortium  \nto accelerate and scale sustainable packaging,  \nand our commitment to increasing spend  \nwith diverse-owned media partners in the  \nU.S. to help dismantle growth barriers  \nfor diverse-owned companies.  \nAnd through the newly established McDonald’s \nCommunity Fund, the Company is better prepared \nthan ever to respond when people need us  \nmost—whether by investing in Chicago-based \nneighborhood organizations that are actively \nand effectively working to address the youth \nopportunity crisis in our hometown, or a  \ncorporate contribution of $5 million to an  \nemployee assistance fund to support our  \nUkrainian colleagues through the ongoing crisis.A banner year because of the  \nunparalleled strengths of the  \nMcDonald’s System \nOur significant progress—despite continued  \nchallenges like none of us have experienced in  \nour lifetimes—is remarkable. In 2021, we achieved  \nrecord global Systemwide sales1 of $112 billion, \nwith revenues of $23.2 billion. We reported annual \ncomparable sales growth in the U.S. of 13.8%, which \nrepresents over $5 billion of Systemwide sales2  \ngrowth. We delivered record operating income of  \nmore than $10 billion. And Franchisee cash flows hit  \nall-time highs in most of our top markets, including  \nthe U.S., U.K., Canada, Germany and Japan.  \nMcDonald’s and our Franchisees are not only  \nwell positioned to withstand the ongoing global  \npressures, but we are set up for the long-term.  \nWhen times are at their darkest, again and again, \nwe see the Golden Arches shine their brightest. And \nwhile what happens next in Ukraine is unclear, we will \ncontinue to support our McFamily and communities \nin Ukraine for as long as is needed.Annual Letter to Shareholders\nWhen times are \nat their darkest, \nagain and again, \nwe see the Golden \nArches shine their \nbrightest. Standards to strengthen our commitment \nto fostering safe, respectful and inclusive \nworkplaces; our Mutual Commitment to Diversity, \nEquity and Inclusion alongside our suppliers to \nsupport diverse-owned businesses; reaching \nglobal gender pay parity; and raising wages at U.S. \ncompany-owned restaurants. Supporting restaurant teams  \nthrough a culture of care \n2021 was a reminder that people remain central  \nto everything we do and everything we seek to  \nachieve. When it comes to being a people  \nbusiness, we will, as Fred Turner said, “never  \nforget it.” At every location, through even the most \ndifficult moments, our crews have stayed strong, \nkeeping our restaurants running while providing \nhope, inspiration and extraordinary service to our \ncustomers and our communities.  \nWe are proud to offer programs and resources  \nthat support our people, both at work and at  \nhome. Over the past two years, this has  \nincluded simplifying our menu to improve the  \ncrew experience, implementing COVID-19  \nsafety measures to protect the wellbeing of  \ncrew members, enhancing parental leave for  \nU.S. McOpCo management, and modernizing  \nour employee value proposition. We continue \ninvesting to make our entire System even stronger, \ncreating an environment where Franchisees, \nsuppliers and employees thrive through initiatives \nsuch as the implementation of Global BrandAnnual Letter to Shareholders\nSignificant progress in the first \nyear of our holistic strategic plan, \nAccelerating the Arches \nIt would not have been possible to lead our  \nindustry for over 65 years if we remained content  \nwith yesterday’s successes. 2021 was no exception.  \nIn the first full year of Accelerating the Arches , we  \nmet the changing needs of our customers by leaning \ninto the competitive advantages essential to our \nfuture as we Maximized our Marketing, Committed  \nto our Core Menu, and Doubled Down on the 3 Ds  \nof Digital, Drive Thru and Delivery.   \nWhile each pillar of our Accelerating the Arches \nstrategy is formidable on its own, the real power  \nis when the M, C and D come together  \nin combination—with the customer at the center.  \nWe continued to strengthen our leadership to \nsupport execution of the strategy. Last year, I was \nproud to announce McDonald’s first ever Chief \nCustomer Officer—Manu Steijaert—to lead the \nnewly created Customer Experience T eam, which \nwill ensure we stay focused on creating frictionless \nexperiences that are seamless and memorable.  \nManu’s appointment was complemented by \nadditional leadership moves, including Paul Pomroy \nas Corporate Senior Vice President, International \nOperated Markets; and Morgan Flatley as Global  \nChief Marketing Officer. We were also excited to \nappoint Desiree Ralls-Morrison as our new General \nCounsel and Corporate Secretary.  \nI am honored to surround myself with a leadership \nteam that elevates and expands our collective \nthinking, and delivers results that propel our  \nbrand forward.  Our focus on the M-C-Ds has driven broad-based  \ngrowth in 2021. Our digital engine continues to  \nmake the customer experience more seamless  \nand fuels growth in the process. In our top six \nmarkets, more than a quarter of Systemwide  \nsales, or $18 billion, came from digital channels  \nin 2021—a 60% increase over 2020. Three of  \nour largest markets  —the U.S., Germany and  \nCanada—all launched loyalty programs in 2021.  \nWith loyalty programs now in more than 40 markets, \nMyMcDonald’s Rewards has exceeded expectations \nin terms of enrollment and participation. After \njust six months in the U.S., there are more than 30 \nmillion loyalty members enrolled and more than \n21 million active members earning rewards. We \nalso announced new long-term global strategic \npartnerships to support McDelivery.  \nWhile we expect that 2022 will be a year of  \ncontinued progress, we also anticipate that many  \nof the challenges we experienced in 2021 will endure. \nFocusing on our foundational operations, expanding \nour growing digital advantages, and continuing to \nput the health and safety of our customers and crew \nfirst will remain critical to executing on Accelerating \nthe Arches.  These accomplishments highlight the \npower of our System when we come together across \nfunctions and geographies, and quickly follow our \ncustomers’ lead. \nChris Kempczinski \nPresident and CEO \nMcDonald’s CorporationA stronger Brand than ever before in person after so long, we asked ourselves, as we \nhave done throughout our history, how we ensure \nthe Brand stays relevant. The answer lies in the \nfounding principles of our model: building a  \nbusiness representative of our customers and \ncommunities, where equity of opportunity is \ncentral to our business. That’s why, late last year, \nwe announced a new Franchisee recruitment \ninitiative to increase the number of Franchisees \nfrom all backgrounds, including historically \nunderrepresented groups, in McDonald’s U.S. and  \nall McDonald’s International Operated Markets.  \nThis includes a $250 million commitment in the U.S. \nover five years to provide alternatives to traditional \nfinancing to help candidates join the McDonald’s \nSystem. During a period of record performance, we \nmust challenge ourselves—even more—to invest in \nthe future. We owe that to our communities—and to \nthe people who make up the McDonald’s System.\nThe enduring strength of McDonald’s Brand gives  \nus confidence that our strategy will continue to \ndeliver sustained, long-term profitable growth  \nfor our System and shareholders. The McDonald’s \nBoard of Directors has provided counsel and an \nunwavering dedication to ensure that in pursuit \nof this objective, we continue to represent all \nstakeholders. I want to thank them, our System,  \nour shareholders, and our customers for their \ncontinued support.  \nAdditionally, I would like to thank the McDonald’s \nBoard of Directors who have provided counsel  \nand an unwavering dedication to represent  \nall stakeholders.\nAnd most importantly, on behalf of the McDonald’s \nSystem, I extend our heartfelt gratitude to our crew. Ray Kroc built McDonald’s as the most independent \nand interdependent Brand on the planet. We see  \nthe power and collaborative spirit of our Brand  \nevery single day—and together, as a System, we  \nwill continue to bring Ray’s vision for collaboration  \nto life, while providing customers the food they \ncrave, experiences they treasure, and the Brand \nthey love. It’s this commitment that will  accelerate \nthe arches  while helping us feed and foster \ncommunities, everywhere. \nEarlier in April and for the first time in four years, \nwe came together as a System at our Worldwide \nConvention. Amid the excitement of being together Annual Letter to Shareholders"
    },
    {
        "question_1": "How much did McDonald's allocate in 2022 for tuition assistance through the Archways to Opportunity program?",
        "answer_1": "$20 million",
        "question_2": "What was the global comparable sales growth percentage for McDonald's in 2022?",
        "answer_2": "Almost 11%",
        "question_3": "How many active loyalty users does McDonald's have in its top six markets?",
        "answer_3": "Almost 50 million",
        "filename": "./docs\\McDonald MCD_2022_Annual_Report.pdf",
        "first_5_page_texts": "Annual ReportWe Are Stronger Than EverDear  \nShareholders, \nthe Global  \nMcFamily and \nour Customers,\nI opened last year’s letter  by stating that \nthere was never a better time to be part of \nBrand McDonald’s. Thanks to the System’s \nhard work, that remains true today.\nDespite facing external pressures in markets \naround the globe in 2022, we continue to \nbuild strong momentum in the business \n– a true testament to the ingenuity of our \npeople, the resilience of our supply chain \nand the dedication of local franchisees and \nrestaurant teams serving our customers.\nIt was incredibly energizing to bring our \nSystem together last April for our first \nWorldwide Convention since the start of  \nthe pandemic. On full display was what I  \nlove most about McDonald’s – our restless \nenergy and ambition. We’re never satisfied, \nwhich is why McDonald’s continues to be \none of the world’s leading corporations after \nalmost 70 years. As Ray Kroc used to say, \n“you’re either green and growing or you’re \nripe and rotting.” In other words, we’re only \ngoing to stay relevant to customers if we’re \nconsistently raising the bar.\nOur Brand is more relevant than ever before, \nbut we still have so much more we can do. \nI’m proud that as we operate from a position \nof strength, we are all pushing ourselves  \nAnnual Letter to Shareholderspopular, we also launched our largest global  \ncampaign ever for the FIFA World Cup,  “Wanna  \ngo to McDonald’s?”\nWe are also capitalizing on the strength of the  \n‘billion-dollar brand equities’ in our Core  (“C”)   \nmenu – 10 in total – and growing market share  \nin chicken and beef.  \nMoreover, Digital, Delivery and Drive Thru  (3-“Ds”) \ncontinue to demonstrate huge growth potential.  \nWe remain focused on meeting customers where  \nthey are and providing more personalized \nexperiences. We now have almost 50 million  \nactive loyalty users in our top six markets.\nto make the right moves to meet the needs of our \ncommunities and ensure enduring, profitable growth \nfor all stakeholders.\nGrowing market share through \ncustomer centricity  \nThe System’s alignment around our Accelerating the \nArches  growth strategy, which we put in place at the \nstart of the pandemic, has put us in an advantageous \nposition. We are growing market share in most of our \nmarkets; the Brand is more relevant to customers \nand stakeholders than it has been in years; and, since \n2020, we’ve achieved an increase in Systemwide \nsales 1  of nearly $20 billion.  \nThat momentum continued through 2022, as global \ncomparable sales grew by almost 11% – and global \nguest counts grew by 5%. Our success is a direct \nresult of our continued focus on our M, C, D  \ngrowth pillars:\nWe continue to elevate our Marketing (“M”) through \ncreative excellence and by driving programs with \ncultural relevance that can be scaled across markets. \nNot only do our Famous Orders remain hugelyAccelerating the \nArches has put us in an \nadvantageous position\nEarning the right to meet customer \nneeds in new ways  \nIt’s clear that our business plan is working. However, \nas we have throughout our history, we continue  \nto push ourselves to keep our Brand relevant for \nfuture generations. \nWe asked ourselves two questions: Is there \nanything we should add to Accelerating the Arches ? \nAnd is there anything that could get in the way of its \ncontinued success?  \nAnnual Letter to Shareholders1 Consists of both Company and franchised sales\nThe answer to these two questions led us to evolve \nour Accelerating the Arches  strategy to set up a \nstrong foundation for future growth. We’ll continue \nto double down on our M, C, D growth pillars, while \naccelerating the pace of new restaurant openings \nwhere there is increased customer demand, alongside \na diverse base of franchisees to run them. Additionally, \nwe’re implementing Accelerating the Organization to \nmodernize the way we work as a company so that \nwe’re faster, more innovative and more efficient.\nT o drive these critical elements of our evolved \nstrategy, we have created new leadership roles on  \nour global Senior Leadership T eam and appointed \nvalues-based leaders into new roles.  \nMorgan Flatley has been promoted to Executive \nVice President, Global Chief Marketing Officer and \nNew Business Ventures, where she will continue to \noversee our award-winning marketing efforts and \nexpand her scope to lead new business ventures with \nopportunities that extend the reach of the Brand in \nnew ways.  \nSkye Anderson has been elevated to President,  \nGlobal Business Services (GBS). Skye will oversee GBS,  \na new business unit of McDonald’s that will make the \norganization more efficient, make it easier for teams \nto collaborate and free up time for our markets to \nfocus on driving growth in the business.   \nThese appointments were complemented by \nadditional leadership moves: Kevin Ozan to Senior \nExecutive Vice President, Strategic Initiatives; Ian Borden to Executive Vice President, Chief \nFinancial Officer; Marion Gross to Executive Vice \nPresident, Global Chief Supply Chain Officer; and Jo \nSempels to President, International Developmental \nLicensed Markets. \nIn addition to these moves, we were delighted \nfor Jill McDonald to rejoin McDonald’s last year \nas President, International Operated Markets. \nAnd we also welcomed Brian Rice as our new \nExecutive Vice President, Global Chief Information \nOfficer, and Jon Banner as our new Executive Vice \nPresident, Global Chief Impact Officer.\nI am proud to work closely with such a dynamic \nteam that collectively acts as a phenomenal \nsteward of the Brand. Every single leader embodies \nour values and plays a crucial role in driving efforts \nthat propel our growth.   \nTaking meaningful action to advance  \nequity of opportunity  \nBeyond meeting the changing needs of our \ncustomers, Accelerating the Arches  is guiding  \nour efforts to feed and foster communities and \nmake the Golden Arches shine for more people.  \nAs a first job for thousands and a first opportunity \nfor many entrepreneurs to run their own \nbusinesses, we feel a special responsibility to  \noffer even more meaningful opportunities.  \nMeeting customers \nwhere they are\nAnnual Letter to Shareholderschanges. And it’s more important than ever that  \nwe raise our ambition to meet tomorrow’s \nchallenges and make the important decisions  \nthat go with them.\nAs we closed out 2022 and hit the ground running \nin 2023, we have a lot to be proud of and a lot to \nlook forward to – not just in the year ahead, but in \nthis next great chapter at McDonald’s. Throughout \nthis chapter and beyond, I am confident that we will \ncontinue to deliver sustained, long-term, profitable \ngrowth for our System and shareholders.\nThank you to our shareholders and valued \ncustomers for your continued support; thank you to \nour Board of Directors for their ongoing guidance \nand support; and thank you to the McDonald’s \nSystem for making this another year of which I am \nimmensely proud. In the last year, this included advancing education \nand skill development opportunities. We awarded \nmore than $20 million in tuition assistance, and \naccess to education for more than 10,000 employees \nthrough our Archways to Opportunity  program. \nAdditionally, we launched support for 40 non-\nprofits that provide pre-employment support and \nskills development primarily to Black and Latinx \ncommunities through the new Chicago Community \nImpact Grants  program.\nKey to building a talent pipeline of future leaders \nand expanding opportunity is fostering a culture of \ninclusivity. In 2022, as part of our Allyship through \nAccountability  program, we introduced expectations \nthat hold all Vice Presidents, Senior Vice Presidents \nand Managing Directors accountable for engaging in \ninclusive behaviors that support talent development \nand build a strong, diverse succession pipeline – \nwith their performance against these expectations \ndirectly contributing to their compensation.\nMoreover, we’ve taken additional steps to champion \nentrepreneurship and generational wealth across \nour System. This is of particular importance as we \nseek to increase our recruitment of first-time owners \nfrom underrepresented groups. Building on our 2021 \ncommitment of $250 million to further diversify our \nfranchisee base, we announced additional steps to \nbring clarity, transparency and consistency to our \nfranchising processes.  \nThese actions advance our efforts to keep equity  \nof opportunity central to our business, while \nensuring that our franchisee base better reflects  \nthe communities we serve.\nRaising the bar for the future\nDuring one of McDonald’s first Worldwide \nConventions, Ray Kroc said: “We are living in a rapidly \nchanging world, so McDonald’s will change with it.” \nMcDonald’s has a deep legacy of holding ourselves \nto the highest standards as the world around usChris Kempczinski \nPresident and CEO \nMcDonald’s Corporation\nFostering a  \nculture of care  \nand opportunity\nAnnual Letter to Shareholders"
    },
    {
        "question_1": "What is the per share dividend amount announced by McDonald's?",
        "answer_1": "$1.67",
        "question_2": "When is the dividend payable date for McDonald's shareholders?",
        "answer_2": "March 15, 2024",
        "question_3": "How many McDonald's locations are there worldwide?",
        "answer_3": "over 40,000",
        "filename": "./docs\\McDonald Q1-24 Dividend Release.pdf",
        "first_5_page_texts": " \n  \n \nInvestor Release      \nFOR IMMEDIATE RELEASE  FOR  MORE  INFORMATION  CONTACT:  \n02/07 /2024  Investors:  Mike Cieplak, investor.relations@us.mcd.com  \n  Media:  Lauren Altmin, lauren.altmin@us.mcd.com  \n \nMcDONALD'S ANNOUNCES QUARTERLY CASH DIVIDEND \n \nCHICAGO, IL -  Today, McDonald's Board of Directors declared a quarterly cash dividend of $1.67 per  share of common \nstock payable on March  15, 2024 to shareholders of record at the close of business on March  1, 2024.  \n \nUpcoming Communications  \nFor important news and information regarding McDonald's, including the timing of future investor conferences and \nearnings calls, visit the Investor Relations section of the Company's Internet home page at www.investor.mcdonalds.com. \nMcDonald's uses this we bsite as a primary channel for disclosing key information to its investors, some of which may \ncontain material and previously non- public information.  \n \nAbout McDonald's  \nMcDonald’s is the world’s leading global foodservice retailer with over 40,000 locations in over 100 countries. \nApproximately 95% of McDonald’s restaurants worldwide are owned and operated by independent local business owners.  \n \nForward -Looking Statements  \nThis document contains certain forward- looking statements, which reflect management's e xpectations regarding future \nevents and operating performance and speak only as of the date hereof. These forward- looking statements involve a \nnumber of risks and uncertainties. Factors that could cause actual results to differ materially from expectations  are detailed \nin the Company’s filings with the Securities and Exchange Commission, including the risk factors discussed in Exhibit \n99.2 to the Company’s Form 8- K filing on February  5, 202 4. The Company undertakes no obligation to update such \nforward -looki ng statements, except as may otherwise be required by law.  \n \n \n"
    },
    {
        "question_1": "What is the new sustainable finance target set by OCBC for 2025?",
        "question_2": "By how much did OCBC's net profit increase in 2021 compared to 2020?",
        "question_3": "What is the Common Equity Tier 1 Capital Adequacy Ratio of OCBC in 2021?",
        "filename": "./docs\\OCBC-2021-annual-review-en.pdf",
        "first_5_page_texts": "Annual Report 2021\nCreating a Sustainable World.\nIt’s all in our hands.\nOversea-Chinese Banking Corporation Limited  Annual Report 2021Creating a Sustainable World.\nIt's all in our hands.\nFeatured on the cover this year is the \nlandscape of/uni00A0Guilin, located in Guangxi Province, China. The/uni00A0area surrounding Guilin has some of the most/uni00A0beautiful karst/uni00A0mountains in the world. Its  Li (Lijiang) River is a sight to behold, and/uni00A0connects beautiful downtown Guilin with/uni00A0the riverside town of Yangshuo.\nAs Guilin goes through rapid urban \ndevelopment, its/uni00A0city and nature continue/uni00A0to co-exist in harmony,  making it a sustainable model of note.\nThat’s why we chose to feature Guilin. \nWe/uni00A0recognise the impact of our actions, and what we must do to/uni00A0protect our ecosystems to create a sustainable world for future generations to live in. \nAdvancing sustainability is therefore \ncentral to OCBC’s strategy. From supporting our clients in their transition to a low-carbon world  with a new sustainable finance target of S$50/uni00A0billion by 2025 and achieving carbon neutrality in our banking operations in 2022, to partnering Singapore NParks in the creation of the OCBC Arboretum, launching the OCBC Climate Index in Singapore to raise awareness about carbon emissions from human activities and to nudge more environmentally sustainable behavioural changes and committing another S$30/uni00A0million to deepen sustainability education among our 30,000/uni00A0employees, we want to play our role as a catalyst for change. Please refer/uni00A0to pages 22 to 25 to find out more about how we are creating pathways towards such advances.\nEach and every one of us can do our \npart/uni00A0to create/uni00A0a/uni00A0sustainable world for the/uni00A0benefit of our/uni00A0future/uni00A0generations.\nIndeed, it is all in our hands.Group Overview\nMessage from Chairman and CEO 2\nExcel for Sustainable Growth 14\nBoard of Directors 16\nManagement Committee 20\nA Leading Sustainable Bank in the Region 22\nOur Year in ReviewUpfront with Helen – Group Chief Executive Officer 26\nUpfront with Darren – Group Chief Financial Officer 32\n Financial Highlights 34\n Creating Investor Value 35\nUpfront with Khiang Tong – Group Chief Operating Office 36\nUpfront with Vincent – Group Chief Risk Officer 40\nCaring for Our Community and the Environment 42\nUpfront with Sunny – Global Consumer Financial Services 46\nUpfront with Bahren – CEO, Bank of Singapore 48\nUpfront with Linus – Global Commercial Banking 50\nUpfront with Elaine – Global Corporate Banking 52\nUpfront with Kenneth – Global Treasury 54\nUpfront with Jason – Group Human Resources 56\nGovernanceCorporate Governance 60\nAdditional Information on Directors Seeking Re-Election 78\nAdditional Information Required under the SGX-ST Listing Manual 86Capital Management 87\nRisk Management 89\nPillar 3 Disclosures 101\nFinancialsFinancial Report\n Management Discussion and Analysis Financial Statements105\nShareholding Statistics 263\nFive-Year Ordinary Share Capital History 265\nAdditional Information\nFurther Information on Management Committee 266\nInternational Network 270\nFinancial Calendar 272\nCorporate Profile and Corporate/uni00A0Information Inside Back CoverContentsMessage from Chairman & CEO\nOCBC emerged from 2021/uni00A0as a \nmore resilient and stronger bank and is well-positioned to capture the opportunities arising/uni00A0from  \nthe restoration of Asia’s medium- and long-term promising growth trajectory. We/uni00A0built stronger momentum across our diversified franchise and delivered resilient and sustainable earnings while raising the bar to support our customers, employees and communities. We further refined our strategic focus and enhanced our capacities to drive sustainable value for all our/uni00A0stakeholders.\nFrom left Mr Ooi Sang Kuang\nChairmanMs Helen WongGroup Chief Executive OfficerDelivering Operational Excellence/uni00A0in 2021\n Refined organisational accountabilities and enhanced output capacities\n Sharpened key strategic priorities: seizing opportunities arising from Asia’s growth; accelerating \ndigitalisation; driving sustainability; and forging a holistic “One Group” integrated customer experience, to ensure sustainable long-term growth for/uni00A0stakeholders\n Stepped up virtual engagement with our customers and enhanced digital experience\n Provided added support measures to employees, encouraged vaccination and stayed agile in working-from-home arrangements, to ensure staff safety/uni00A0and health\n Maintained consistently high service level to customers while enhancing process, efficiency and  \noperating capacityDear Shareholders\n2021 started on a hopeful note  \nwith the rapid rollout of Covid-19 \nvaccination programmes, but this achievement and the revival of economic activities during the year/uni00A0were disrupted by the spread of/uni00A0the more contagious and dangerous Delta variant. However, extraordinary strong monetary stimulus and expansionary fiscal spending by the major economies supported economic growth and lifted financial markets activities. Global/uni00A0GDP in 2021 rebounded 5.9% from/uni00A0a year ago, but recovery/uni00A0was uneven/uni00A0between the/uni00A0developed and/uni00A0developing economies. In our key markets, Singapore, China and Hong Kong SAR’s output growth outpaced the global average, while/uni00A0Malaysia and Indonesia saw/uni00A0moderate growth. In an environment of uneven economic recovery and the ongoing more severe pandemic, OCBC remained robust and delivered a solid operating performance with our 2021 net/uni00A0profit 35% higher than 2020.  \nThis is a sound testament to the strong foundation we have built/uni00A0over the years to reinforce our diversified franchise. \nGroup Overview 22021 FINANCIAL PERFORMANCE\nOur diversified and well-established banking, wealth management and insurance franchise has continued \nto enable us to consistently deliver sustainable and well-balanced earnings through another year of great/uni00A0uncertainties.\nNet Profit (S$ million) Earnings per Share (S$) Return on Assets (%) Return on Equity (%)\n3,586 4,85835%\n2020 20210.80 1.0734%\n2020 2021 2020 20210.85 1.130.3 \npercentage points\n7.6 9.6\n2020 20212.0 \npercentage pointsDespite the public health crisis impacting in waves during the year in 2021, we recorded a robust set of financials \nwith net profit rebounding by 35%.\n  Further details on financial information are on pages 106 to 262 of this annual/uni00A0report.Total Income  \n(S$ million)Operating Expenses  \n(S$ million) and  \nCost-to-income Ratio\n2020 20214,439 4,76443.8% 45.0%\n7%\n10,139 10,5965%\n2020 2021Our customer franchise drove higher fee income, \nstrong customer treasury flows, and increased  \nwealth management and insurance income. The rise in our expenses was associated with the continued investments in talent and technology to expand our/uni00A0capabilities.\nCustomer Loans  \n(S$ billion)Customer Deposits  (S$ billion) and CASA ratio\n2020 2021315 34260.3%63.3%\n9%\n267 2908%\n2020 2021Backed by OCBC’s strong network capabilities, we \nwidened our customer network through broad-based loan growth and expanded deposit franchise.\nNon-performing Loan \n(NPL) Ratio (%)Credit Costs  (basis points)\nunchanged\n2020 20211.5 1.538 bps\n2020 202167 29The prudent management of credit risk kept asset \nquality sound and NPL ratio stable. Expected credit loss allowances were significantly lower. \nCommon Equity Tier 1 \nCapital Adequacy Ratio (%)One of the World's Most  Highly-rated Banks\nS&PAA-\nMoody'sAa1 AA-\nFitchTop 10 Strongest Banks \nin Asia Pacific\nThe Asian Banker\n15.2 15.5\n2020 20210.3 \npercentage pointsOur strong capital position and credit ratings were \nmaintained in an environment of heightened uncertainties.OCBC Annual Report 2021 3"
    },
    {
        "question_1": "What was OCBC's record net profit for the year 2022?",
        "answer_1": "$5.75 billion",
        "question_2": "How much did OCBC commit to new sustainable finance commitments in 2022?",
        "answer_2": "Over $10 billion",
        "question_3": "What was the increase in the dividend per share from the previous year for 2022?",
        "answer_3": "28%",
        "filename": "./docs\\OCBC-2022-annual-report-en.pdf",
        "first_5_page_texts": "Oversea-Chinese Banking Corporation Limited  Annual Report 2022Annual Report 2022Our Sustainable Future. Our Enduring Legacy.Excel for \nSustainable \nGrowth.Contents\n1 Key Highlights\n2 Message from Chairman and CEO\n6 Excel for Sustainable Growth\n8 Financial Highlights\n9 Creating Investor Value\n10 A Leading Sustainable Bank in the Region\n14 Creating Positive Impact for Society\n16 Connecting with the Community through Sports\n18 Fighting Climate Change in the Community\n20 Board of Directors\n22 Management Committee\n24 Upfront with Helen – Group Chief Executive Officer\n28 Upfront with Chin Yee – Group Chief Financial Officer\n30 Upfront with Khiang Tong – Group Chief Operating Officer\n32 Upfront with Noel – Group Chief Risk Officer\n34 Upfront with Sunny – Global Consumer Financial Services\n36 Upfront with Teck Long – Global Wholesale Banking\n38 Upfront with Kenneth – Global Treasury\n40 Upfront with Hwee Boon – Group Human Resources\n42 Bank of Singapore Highlights\n44 Corporate Governance\n63 Additional Information on Directors Seeking Re-election\n67 Additional Information required under SGX-ST Listing Manual\n68 Capital Management\n70 Risk Management\n84 Pillar 3 Disclosures\n88 Financial Report\nManagement Discussion and Analysis\nFinancial Statements\n253 Shareholding Statistics\n255 Five-Year Ordinary Share Capital History\n256 Further Information on Board of Directors\n259 Further Information on Management Committee\n264 International Network\n266 Financial Calendar\nIBC Corporate Profile and Corporate Information\nFeatured on our cover this year is the mangrove tree, which absorbs CO 2 at \na prodigious rate. Four times as much carbon can be trapped and stored in \nmangrove forests and their surrounding mudflats and soil than in comparable \ntropical forests. For OCBC’s 90th anniversary in 2022, we gifted two mangrove \nprojects to the community – 9,000 trees at the OCBC Mangrove Park in Singapore \nand another 9,000 at the Tebuk Mendeleng mangrove project in Malaysia. These \ntrees will absorb more than 30 million kg of CO 2 in their lifetimes. Mangroves \nalso provide natural infrastructure for greater biodiversity as well as protection \nagainst erosion and storm surges. OCBC has been expanding nature-based \ncarbon storage solutions to help fight climate change.\nAll figures in this Annual Report are in Singapore dollars unless otherwise specified.Key Highlights\nOver $10 billion  in new \nsustainable finance commitments \nto bring total commitments to  \n$44 billion, on track to achieve  \n$50 billion by 2025Achieved  carbon neutrality \nfor emissions from banking \noperationsOver 500,000  man-hours \nin productivity improvement\nUnveiled OCBC Mangrove \nPark , Singapore, part of a \n18,000-mangrove tree contribution \nto fighting climate changeInvested over $250 million \nin Phase One (2019 – 2022) of \nseven-year Digital Core Roadmap \nto accelerate digital transformationOver 65,000  staff \nvolunteer hours logged in \nhelping the disadvantaged \nin our communities Record net profit of\n$5.75 billion$25 billion net new money \ninflows across Bank of Singapore \nand OCBC wealth management \nfranchiseUplifted Hong Kong hub  \ncapability to support ASEAN-\nGreater China trade and \ninvestment flows\nOCBC Annual Report 2022\n1\n Key Highlights“It was a year of strong \nperformance for OCBC. \nDespite economic \nchallenges, we achieved \nour best-ever net profit. \nWe executed our \ntransformational \nstrategic priorities to \ndrive growth and doubled \ndown on our sustainability \nefforts. We supported \nand made a difference \nto our stakeholders – \ncustomers, employees, \ncommunities and \nshareholders. We are \nconfident that OCBC \nwill grow from strength \nto strength for many \nyears to come.”Dear Shareholders\n2022 was the year OCBC celebrated its \n90th anniversary. We delivered our best-\never net profit despite considerable \nglobal headwinds. We continued to \nachieve good progress in executing on \nour strategy, and made significant \nadvancements in our commitment to \nour sustainability agenda. Our \norganisational capabilities were further \nenhanced. We stepped up investments in \ntechnology and our people which yielded \npositive outcomes, while wholeheartedly \nsupporting the communities we serve. \nOCBC remains fully committed to deliver \nexcellence and sustainable value for all \nour stakeholders.\nWith much of the world adapting to \nCovid, 2022 had initially started on a \npositive footing. Developed countries \nwere gradually reopening, providing \nmomentum for a global economic recovery. \nHowever, the start of the Russia-Ukraine \ncrisis in February 2022 precipitated a \nspike in commodity and energy prices, \ndisrupted supply chains and heightened \nvolatilities in financial markets. Inflation \nturned out to be higher and more persistent \nthan the initial expectations of many \ncentral banks. Monetary policies were \ntightened through a series of rapid \ninterest rates hikes. In Greater China, \nongoing pandemic-related restrictions \nduring the year contributed to \na slowdown in economic activities. \nThe combination of these conditions \ncurtailed global growth in 2022. Despite these headwinds, OCBC delivered \na record operating performance in 2022. \nAccordingly, we are pleased to raise our \n2022 dividend to 68 cents, up 28% from \nthe previous year.\nRecord Financial Performance\nWe achieved record high Group net profit, \nimproved return on equity, better efficiency \nratios and increased shareholder returns, \nwhilst we maintained our strong capital \nposition. Our diversified income streams \nacross business lines and geographies \nenabled us to deliver well-balanced \ngrowth. Our results reflect the foundations \nwe have laid in the previous years to \ngrow our franchise, optimise our balance \nsheet and prudently manage our portfolio.\nOCBC Group net profit rose 18% to \n$5.75 billion. Return on equity of 11.1% \nwas 1.5 percentage points above 2021, \nwhile earnings per share rose 20 cents \nto $1.27. Total income increased 10% to \n$11.7 billion, largely driven by higher \nnet interest income, which surpassed \n$7 billion for the first time, on the back \nof asset growth and net interest margin \nimprovement. Our well-positioned \nbalance sheet allowed us to benefit from \na rising interest rate environment and \nnet interest margin expanded 37-basis \npoints to 1.91%, the highest level in over \n10 years. Operating expenses rose less \nthan income growth, as we maintained \ncost discipline and paced our ongoing \ninvestments to drive franchise growth, \nraise productivity and deliver operational \n2Message from  \nChairman & CEOStrong Financial  \nPerformance\n$11.7b\nRecord Total Income10%\n$5.75b\nRecord Net Profit18%\n$295b\nCustomer Loans2%\n4.5%\n(in constant \ncurrency terms)\n$350b\nCustomer Deposits2%Progressing on  \nSustainability Agenda\n$44b\nSustainable Financing \nCommitments30%\nNet-Zero by 2050\n1 of only 4 ASEAN Banks to \nPledge Commitment\nCarbon Neutrality\nAchieved for Banking \nOperational Emissions>$3b\nSME Sustainable  \nFinancing Commitments>50%Creating Value for  \nShareholders\n$1.27\nEarnings Per Share18%\n11.1%\nReturn on Equity1.5\npercentage points\n1.25%\nReturn on Assets0.12\npercentage points\n68 cents\nHigher Dividend Per Share28%\nMaking Great Leaps Forward \nin Our Sustainability Journey\nThe firm commitment of the Board and \nManagement to effective stewardship \nand corporate governance is the bedrock \nof our stakeholders’ trust in us, and we \ncontinue to be recognised for our high \nstandards of governance and responsible \nbusiness practices. We adopt a robust \nand holistic approach to positive \nenvironmental, social and governance \n(ESG) factors. This is integrated across \nhow we operate our business and manage \nour risks. Our ongoing efforts relating to \nsustainability have led us to earn an \ninaugural inclusion on the Steward \nLeadership 25 list, awarded by the \nStewardship Asia Centre, as well as on \nthe FTSE4Good Index. Further details are \nshared in our Sustainability Report which \nis separately published on our website.\nDriving Transition to Low-Carbon \nEconomy\nWe established a Board Sustainability \nCommittee to give greater focus on our \nsustainability agenda, a key strategic \npillar. In 2022, we achieved carbon \nneutrality for our banking operational \nemissions. We are one of only four banks \nin ASEAN to pledge our commitment \ntowards achieving net-zero in our \nlending and investments businesses \nby 2050 as a signatory to the United \nNations-convened, industry-led Net-Zero \nBanking Alliance. We have begun \ndeveloping a systematic plan to achieve \nthis goal and aim to unveil our sectoral financed emission targets by the \nfirst half of 2023. As part of our \ndecarbonisation efforts, more than \n$25 million will be deployed in energy-\nefficient technology across the Group in \nSingapore, Malaysia and Greater China. \nWe sponsored two large-scale mangrove \nrestoration projects in Singapore and \nMalaysia in commemoration of our \n90th anniversary. In Singapore, $3 million \nwill be contributed to the OCBC Mangrove \nPark to help grow 9,000 mangrove trees. \nAcross neighbouring Malaysia, another \n9,000 trees will also be grown at the \nTebuk Mendeleng mangrove project in \nthe state of Selangor. efficiencies. With a comparatively better \ncredit environment in 2022, total \nallowances of $584 million were 33% lower.\nLoans grew 4.5% on a constant currency \nbasis to $295 billion while deposits were \nup 2% to $350 billion. With proactive \nmonitoring and stress testing of our \nloan book, our portfolio quality remained \nresilient with the non-performing loan ratio \ndeclining to 1.2%. Our non-performing \nassets coverage ratio stood at 114%.\nOur strong funding, liquidity and capital \npositions were maintained, with CET1 \nratio at 15.2%. This provides us with \ncontinued flexibility to pursue growth \nopportunities and buffer for uncertainties. \nWe are one of the world’s most highly-\nrated banks with Aa1 credit rating from \nMoody’s and AA- from both Fitch and S&P.\nDividends \nThe Board has recommended a final \ndividend of 40 cents per share, which \nbrings the full year 2022 dividend to \n68 cents, a 28% increase from the \nprevious year’s 53 cents. Barring \nunforeseen circumstances, we aim to \ndeliver a dividend payout ratio of 50%. \nFull year 2022 payout ratio is at 53% \nagainst net profit, which exceeds 49% \na year ago. The dividend increase \ndemonstrates our strong capital position \nand confidence in OCBC’s ability to \ngenerate earnings growth over the \nlong-term.Achievements\nOne of the World’s Best Banks \n(Singapore)\nAwarded by Forbes\nOne of the Strongest Banks in \nAsia Pacific\nAwarded by The Asian Banker\nBest Managed Board above $1b in \nmarket cap (Bronze)\nAwarded by Singapore Corporate Awards\nMost Transparent Company Award, \nRunner Up\nAwarded by the Securities Investors \nAssociation (Singapore)\nIncluded on the FTSE4Good Index\nOCBC Annual Report 2022\n3\n Message from Chairman & CEO"
    },
    {
        "question_1": "What was Nestlé's total group sales in CHF for 2023?",
        "answer_1": "93.0 billion",
        "question_2": "What is the proposed dividend per share in CHF for 2023?",
        "answer_2": "3.00",
        "question_3": "How much did Nestlé reduce its GHG emissions by 2023 from 2018 levels?",
        "answer_3": "13.58%",
        "filename": "./docs\\OCBC-2023-annual-review-en.pdf",
        "first_5_page_texts": "Nestlé – Annual Review 2023\nNestlé.\nWe unlock the power of food \nto enhance quality of life for everyone, \ntoday and for generations to come.Annual Review 2023Our purpose\nContents Accompanying reports\nYou can find more information  \nabout the Nestlé Group at  \nwww.nestle.com\nFind out more about Creating Shared \nValue at www.nestle.com/csvOnlineFront cover\nMilo As the world’s leading chocolate malt beverage, Milo delivers nutritious \nenergy and encourages kids to stay active and grow with sports, engaging over 30 million kids annually through grassroots sports programs.Corporate Governance Report 2023 Compensation Report 2023 Financial Statements 2023  2  L etter to our shareholders \n 4   Our  people on the ground\n 8  Implementing our  growth   \n  strategy \n 12  Cr eating Shared Value\n 16 C onnecting through our brands\n 32  Financial r eview  \n 56  C orporate Governance  \n  and C ompliance\n 63  Shar eholder informationNestlé. Unlocking the power of food to enhance quality of life for everyone, \ntoday and for generations to come.Nestlé Annual Review 20231A summary of the 2023  \nfull-year results is shown here. \nFor full results, please consult \nthe ’Financial review‘ section.\n* Financial performance \nmeasures not defined by \nIFRS Accounting Standards. \nFor further details, see \n’Financial review’ on page 34.Group sales (in CHF) Organic growth * Real internal growth *\n93.0  billion + 7.2% – 0.3%\nUnderlying trading \noperating profit *  \n(in CHF)Underlying trading \noperating profit  \nmargin *Underlying trading  \noperating profit  \nmargin *\n16.1  billion 17.3% + 40  Basis points\nConstant currency\nTrading operating  \nprofit * (in CHF)Trading operating  \nprofit margin *Trading operating  \nprofit margin *\n14.5  billion 15.6% + 190  Basis points\nConstant currency\nEarnings per share  \n(in CHF)Earnings  \nper shareUnderlying earnings  \nper share *\n4.24 + 23.7% + 8.4%\nConstant currency\nOperating cash flow  \n(in CHF)Free cash flow * \n(in CHF)\n15.9  billion\n32.1% of net financial debt10.4  billion\nProposed dividend  \n(in CHF)Proposed dividend  \nincrease\n3.00 + 1.7%Our financial performance\nOur Nutrition, Health and Wellness strategy is fundamental to how we create value.What we sell (in CHF billion)\nWhere we sell (in CHF billion)\nNumber of employees Number of countries we sell in\n270 000 188\nTotal group salaries and social  \nwelfare expenses (in CHF)Corporate taxes paid in 2023  \n(in CHF)\n14\nbillion2.8\nbillionOur business\nWe apply our expertise in nutrition, health and wellness to help people and pets \nlive happier, healthier lives. We do this alongside ambitious sustainability goals \nto generate significant value for our shareholders and other stakeholders alike.\nPowdered and \nLiquid Beverages\nConfectionery Water24.8Prepared dishes  \nand cooking aids\n11.7\n8.1 3.3Milk products \nand Ice cream\n11.0Nutrition and \nHealth Science\n15.3PetCare\n18.8\nGC\n5.5EUR\n22.3\nAOA\n19.9LATAM\n12.8NA\n32.5Our key non-financial  \nperformance\nWe create shared value through our social and environmental commitments  \nand supporting actions.\nTo measure our progress, \nwe use a comprehensive set of indicators that support our business performance and generate value for our shareholders and other stakeholders. Some key performance indicators are included here – the full set is  in our Creating Shared Value and Sustainability Report.Climate Our KPI  *\nWe aim to reduce our greenhouse gas (GHG) emissions by 20% by 2025 and 50% by 2030 from 2018 levels, on the road to net zero by 2050 at the latest 13.58%  \nnet reduction of GHG emissions versus 2018 baseline  (a)\n(a) Covers emissions related to our net zero commitment.  \nNet reductions (%) includes removals from both insetting and landscape projects.\nNature Our KPI  *\nWe aim to achieve and maintain \n100% assessed deforestation-free primary supply chains (for meat, palm oil, pulp and paper, soy and sugar) by 2022 and 2025 for cocoa and coffee 93.4%\nassessed deforestation-free for stated primary supply chains\nPackaging Our KPI  *\nBy 2025, we aim to reduce virgin plastics by one third versus our 2018 baseline14.9%\nvirgin plastic reduction versus 2018 baseline\nDiversity, equity \nand inclusionOur KPI  *\n46.4%\nmanagement positions held by women\nYouth Our KPI  *\nBy 2030, our ambition is to \nhelp 10 million young people around the world have access to economic opportunities 7.74  million\nyoung people around the world with access to economic opportunities  \nsince 2017\nHealth and Nutrition Our KPI  *\n127.6  billion\nservings of affordable nutrition with micronutrient fortification  \nprovided in 2023* Non-financial performance \nmetrics are defined  in the Reporting Scope  and Methodology for ESG KPIs document available  at www.nestle.com/esg-kpis\n EY  has performed limited \nassurance on the six key performance indicators  on this page. The assurance statement with EY’s independent conclusion can be found at www.nestle.com/assurance-statement"
    },
    {
        "question_1": "What is the date of the annual report for Shell plc?",
        "answer_1": "December 31, 2022",
        "question_2": "What accounting standards have the Consolidated Financial Statements of Shell plc and its subsidiaries been prepared in accordance with?",
        "answer_2": "International Financial Reporting Standards (IFRS) as issued by the International Accounting Standards Board (IASB)",
        "question_3": "What is the currency used in the Shell plc annual report?",
        "answer_3": "US dollars",
        "filename": "./docs\\shell-annual-report-2022.pdf",
        "first_5_page_texts": "Annual Report and Accounts for the year ended December 31, 2022 Shell plc\n#PoweringProgressPowering \nProgressShell plc\nAnnual Report \nand Accounts\nfor the year ended \nDecember 31, 2022Contents\nIntroduction\niii About this Report\niv Terms and abbreviations\nStrategic Report2 Chair's message\n4 Chief Executive Officer's review\n6 Powering Progress strategy\n15 Risk factors\n27 Progress on strategy – year in review\n27 Performance indicators\n29 Generating shareholder value\n29 Group results\n31 Financial framework\n35 Market overview\n38 Integrated Gas\n44 Upstream\n52 Oil and gas information\n60 Marketing\n65 Chemicals and Products\n73 Renewables and Energy Solutions\n77 Corporate\n78 Our journey to net zero\n106 Respecting nature\n112 Powering lives\n121 Safety\n125 Principal decisions & stakeholders (Section \n172(1) statement)\nGovernance\n133 The Board of Shell plc\n142 Senior management\n144 Introduction from the Chair\n147 Statement of compliance with the UK \nCorporate Governance Code\n148 Governance framework\n150 Board activities\n153 Board evaluation\n154 Understanding and engaging with our stakeholders\n157 Workforce engagement\n159 Nomination and Succession Committee\n163 Safety, Environment and Sustainability Committee\n165 Audit Committee Report\n178 Directors' Remuneration Report\n183 Annual Report on Remuneration\n203 Directors' Remuneration Policy\n211 Other regulatory and statutory information\nFinancial Statements and Supplements\n221 Independent Auditor's Report related to the \nConsolidated and Parent Company Financial Statements\n237 Consolidated Financial Statements\n308 Supplementary information - oil and gas (unaudited)\n327 Supplementary information - EU Taxonomy disclosure\n340 Parent Company Financial Statements\n350 Independent Auditor's Report related to the Royal Dutch Shell Dividend Access Trust Financial Statements\n352 Royal Dutch Shell Dividend Access Trust Financial Statements\nAdditional Information\n358 Shareholder information\n362 Non-GAAP measures reconciliations\n367 Appendix 1: Significant subsidiaries and other \nrelated undertakings (audited)\n388 Appendix 2: Five-year financial dataset\nDesign and  \nproduction: Friend  \nwww.friendstudio.com\nPrint: Toppan Merrill Reports are available in  \nall inclusive formats at  \nShell.com/annual-publicationsReporting for all\nii Shell Annual Report and Accounts 2022The Shell plc Annual Report (this \"Report\") serves as the Annual Report \nand Accounts in accordance with UK requirements for the year ended December 31, 2022, for Shell plc (the \"Company\") and its subsidiaries \n(collectively referred to as \"Shell\"). This Report presents the Consolidated Financial Statements of Shell (pages 237-307), the Parent Company Financial Statements of Shell (pages 340-349) and the Financial Statements of the Royal Dutch Shell Dividend Access Trust  (pages \n352-356 ). Except for these Financial Statements, the numbers presented \nthroughout this Report may not sum precisely to the totals provided and percentages may not precisely reflect the absolute figures due to rounding.\nThe Consolidated Financial Statements of Shell plc and its subsidiaries \ncontained in this Report have been prepared in accordance with \ninternational accounting standards in conformity with the requirements of the UK Companies Act 2006 (the \"Act\"), and therefore in accordance with UK-adopted international accounting standards. As applied to Shell, there are no material differences from International Financial Reporting Standards (IFRS) as issued by the International Accounting Standards Board (IASB); therefore, the Consolidated Financial Statements have been prepared in accordance with IFRS as issued by the IASB. IFRS as defined above includes interpretations issued  by the IFRS Interpretations \nCommittee. Financial reporting terms used in this Report are in accordance with IFRS. \nThis Report contains certain forward-looking non-GAAP measures such \nas cash capital expenditure . We are unable to provide a reconciliation \nof these forward-looking non-GAAP measures to the most comparable GAAP financial measures because certain information needed to reconcile those non-GAAP measures to the most comparable GAAP financial measures is dependent on future events some of which are outside the control of Shell, such as oil and gas prices, interest rates and exchange rates. Moreover, estimating such GAAP measures with the required precision necessary to provide a meaningful reconciliation is extremely difficult and could not be accomplished without unreasonable effort. Non-GAAP measures in respect of future periods which cannot be reconciled to the most comparable GAAP financial measure are calculated in a manner which is consistent with the accounting policies applied in Shell plc’s consolidated financial statements.  \nThe entities in which Shell plc directly or indirectly owns investments are separate legal entities. In addition to the term \"Shell\", in this Report \"Shell Group\", \"Group\", \"we\", \"us\" and \"our\" are also used to refer to the Company and its subsidiaries in general or to those who work for them. These terms are also used where no useful purpose is served by identifying the particular entity or entities. \"Subsidiaries \", \"Shell subsidiaries\" and \n\"Shell companies\" refer to those entities over which the Company has control, either directly or indirectly. Entities and unincorporated arrangements over which Shell has joint control are generally referred to as \"joint ventures\" and \"joint operations\", respectively. \"Joint ventures\" and \"joint operations\" are collectively referred to as \"joint arrangements\". Entities over which Shell has significant influence but neither control nor joint control are referred to as \"associates\". The term \"Shell interest\" is used for convenience to indicate the direct and/or indirect ownership interest held by Shell in an entity or unincorporated joint arrangement, after exclusion of all third-party interest. Shell subsidiaries’ data include their interests in joint operations. \nAs used in this Report, \"Accountable\" is intended to mean: required or \nexpected to justify actions or decisions. The Accountable person does not necessarily implement the action or decision (implementation is usually carried out by the person who is Responsible) but must organise the implementation and verify that the action has been carried out as required. This includes obtaining requisite assurance from Shell companies that the framework is operating effectively. \"Responsible\" is intended to mean: required or expected to implement actions or decisions. Each Shell company and Shell-operated venture is responsible for its operational performance and compliance with the Shell General Business Principles, Code of Conduct, Statement on Risk Management and Risk Manual, \nand Standards and Manuals. This includes responsibility for the operationalisation and implementation of Shell Group strategies and policies.Shell’s operating plan, outlook and budgets are forecasted for a 10-year period and are updated every year. They reflect the current economic environment and what we can reasonably expect to see over the next ten years. Accordingly, they reflect our Scope 1, Scope 2 and NCI targets \nover the next 10 years. However, Shell’s operating plans cannot reflect our 2050 net-zero emissions target and 2035 NCI target, as these targets are currently outside our planning period. In the future, as society \nmoves towards net-zero emissions, we expect Shell’s operating plans to reflect this movement. However, if society is not net zero in 2050 as of today, there would significant risk that Shell may not meet this target. \nShell’s \"Net Carbon Intensity\"  referred to in this Report include Shell’s \ncarbon emissions from the production of our energy products, our \nsuppliers’ carbon emissions in supplying energy for that production, and our customers’ carbon emissions associated with their use of the energy products we sell. Shell only controls its own emissions. The use of the term \"N et Carbon Intensity\"  is for convenience only and not intended \nto suggest these emissions are those of Shell plc or its subsidiaries. \nExcept where indicated, the figures shown in the tables in this Report are in respect of subsidiaries only, without deduction of any non-controlling interest. However, the term \"Shell share\" is used for convenience to refer to the volumes of hydrocarbons that are produced, processed or sold through subsidiaries, joint ventures and associates. All of a subsidiary’s production, processing or sales volumes (including the share of joint operations) are included in the Shell share, even if Shell owns less than 100% of the subsidiary. In the case of joint ventures and associates, however, Shell-share figures are limited only to Shell’s entitlement. In all cases, royalty payments in kind are deducted from the Shell share.  \nExcept where indicated, the figures shown in this Report are stated in US dollars. As used herein all references to \"dollars\" or \"$\" are to the US currency. \nThis Report contains forward-looking statements  concerning the financial \ncondition, results of operations and businesses of Shell. All statements \nother than statements of historical fact are, or may be deemed to be, forward-looking statements. Forward-looking statements are statements of future expectations that are based on management’s current expectations and assumptions and involve known and unknown risks and uncertainties that could cause actual results, performance or events to differ materially from those expressed or implied in these statements. Forward-looking statements include, among other things, statements concerning the potential exposure of Shell to market risks and statements expressing management’s expectations, beliefs, estimates, forecasts, projections and assumptions. These forward-looking statements are identified by their use of terms and phrases such as \"aim\", \"ambition\", \"anticipate\", \"believe\", \"could\", \"estimate\", \"expect\", \"goals\", \"intend\", \"may\", \"milestones\", \"objectives\", \"outlook\", \"plan\", \"probably\", \"project\", \"risks\", \"schedule\", \"seek\", \"should\", \"target\", \"will\" and similar terms and phrases. There are a number of factors that could affect the future operations of Shell and could cause those results to differ materially from those expressed in the forward-looking statements included in this Report, including (without limitation): (a) price fluctuations in crude oil and natural gas; (b) changes in demand for Shell’s products; (c) currency fluctuations; (d) drilling and production results; (e) reserves estimates; (f) loss of market share and industry competition; (g) environmental and physical risks; (h) risks associated with the identification of suitable potential acquisition properties and targets, and successful negotiation and completion of such transactions; (i) the risk of doing business in developing countries and countries subject to international sanctions; (j) legislative, judicial, fiscal and regulatory developments including regulatory measures addressing climate change; (k) economic and financial market conditions in various countries and regions; (l) political risks, including the risks of expropriation and renegotiation of the terms of contracts with governmental entities, delays or advancements in the approval of projects and delays in the reimbursement for shared costs; (m) risks associated with the impact of pandemics, such as the COVID-19 (coronavirus) outbreak; and (n) changes in trading conditions. Also see \"Risk factors\" on pages 15-26 for \nadditional risks and further discussion. No assurance is provided that future dividend payments will match or exceed previous dividend payments. All forward-looking statements contained in this Report are expressly qualified in their entirety by the cautionary statements contained or referred to in this section. Readers should not place undue \nAbout this Report\niii Shell Annual Report and Accounts 2022reliance on forward-looking statements. Each forward-looking statement \nspeaks only as of the date of this Report. Neither the Company nor any of its subsidiaries undertake any obligation to publicly update or revise any forward-looking statement as a result of new information, future events or other information. In light of these risks, results could differ materially from those stated, implied or inferred from the forward-looking statements contained in this Report. \nPast performance cannot be relied on as a guide to future performance.This Report contains references to Shell’s website, the Shell Sustainability \nReport,  Energy Transition Progress Report, Tax Contribution Report, \nIndustry Associations Climate Review and our report on Payments to Governments.  These references are for the readers’ convenience only. \nShell is not incorporating by reference into this Report any information posted on www.shell.com or in the Shell Sustainability Report, Tax Contribution Report, Industry Associations Climate Review or our report on Payments to Governments. The content of any other websites referred to in this Report does not form part of this Report. \nWith effect from January 29, 2022, Shell’s A shares and B shares \nwere assimilated into a single line of ordinary shares. Shell’s A and B American Depositary Shares (ADSs) were assimilated into a single line of ADSs on the same date. This Report continues to refer to A shares, B shares, A ADSs and B ADSs when describing the position prior to January 29, 2022.\nShell V-Power and Shell LiveWire are Shell trademarks. \nDocuments on display \nThis Report is also available, free of charge, at www.shell.com/\nannualreport or at the offices of Shell in London, United Kingdom and The Hague, the Netherlands. Copies of this Report also may be obtained, free of charge, by mail.\nTerms  and abbreviations\nCurrencies\n $ US dollar\n€ euro\n£ sterling\nUnits of me asurement\n acre approximately 0.004 square kilometres\nb(/d) barrels (per day)\nboe(/d) barrels of oil equivalent (per day); natural gas volumes are \nconverted into oil equivalent using a factor of 5,800 scf \nper barrel\nGW gigawatt\nkboe(/d) thousand barrels of oil equivalent (per day); natural gas \nvolumes are converted into oil equivalent using a factor \nof 5,800 scf per barrel\nkWh kilowatt-hours\nmegajoule a unit of energy equal to one million joules\nMMBtu million British thermal unitsmb/d million barrels per daymtpa million tonnes per annumMW megawattMWh megawatt hours\nper day volumes are converted into a daily basis using a calendar yearscf(/d) standard cubic feet (per day)TWh terawatt hours\nProducts\n GTL gas-to-liquids\nLNG liquefied natural gasLPG liquefied petroleum gasNGL natural gas liquids\nMiscellaneous\nADS American Depositary ShareAGM Annual General MeetingAPI American Petroleum InstituteCCS carbon capture and storageCCS earnings earnings on a current cost of supplies basisCMF carbon management frameworkCO\n2 carbon dioxide\nEMTN Euro medium-term noteEPS earnings per shareFCF free cash flowFID final investment decisionGAAP generally accepted accounting principlesGHG greenhouse gas\nHSSE health, safety, security and environment\nIAS International Accounting StandardsIEA International Energy AgencyIFRS International Financial Reporting Standard(s)\nIPIECA International Petroleum Industry Environmental Conservation \nAssociation \nIOGP International Association of Oil & Gas Producers\nLTIP Long-term Incentive PlanNCF Net Carbon FootprintNCI net carbon intensityOECD Organisation for Economic Co-operation and DevelopmentOML oil mining leaseOPEC Organization of the Petroleum Exporting CountriesOPL oil prospecting licencePSC production-sharing contract\nPSP Performance Share Plan\nREMCO Remuneration CommitteeRT real terms\nSEC US Securities and Exchange Commission\nTCFD Task Force on Climate-related Financial DisclosuresTRCF total recordable case frequencyTSR total shareholder return\nWTI West Texas Intermediate\nAbout this Report continued\nThe Shell plc Annual Report (this \"Report\") serves as the Annual Report \nand Accounts in accordance with UK requirements for the year ended December 31, 2022, for Shell plc (the \"Company\") and its subsidiaries \n(collectively referred to as \"Shell\"). This Report presents the Consolidated Financial Statements of Shell (pages 237-307), the Parent Company Financial Statements of Shell (pages 340-349) and the Financial Statements of the Royal Dutch Shell Dividend Access Trust  (pages \n352-356 ). Except for these Financial Statements, the numbers presented \nthroughout this Report may not sum precisely to the totals provided and percentages may not precisely reflect the absolute figures due to rounding.\nThe Consolidated Financial Statements of Shell plc and its subsidiaries \ncontained in this Report have been prepared in accordance with \ninternational accounting standards in conformity with the requirements of the UK Companies Act 2006 (the \"Act\"), and therefore in accordance with UK-adopted international accounting standards. As applied to Shell, there are no material differences from International Financial Reporting Standards (IFRS) as issued by the International Accounting Standards Board (IASB); therefore, the Consolidated Financial Statements have been prepared in accordance with IFRS as issued by the IASB. IFRS as defined above includes interpretations issued  by the IFRS Interpretations \nCommittee. Financial reporting terms used in this Report are in accordance with IFRS. \nThis Report contains certain forward-looking non-GAAP measures such \nas cash capital expenditure . We are unable to provide a reconciliation \nof these forward-looking non-GAAP measures to the most comparable GAAP financial measures because certain information needed to reconcile those non-GAAP measures to the most comparable GAAP financial measures is dependent on future events some of which are outside the control of Shell, such as oil and gas prices, interest rates and exchange rates. Moreover, estimating such GAAP measures with the required precision necessary to provide a meaningful reconciliation is extremely difficult and could not be accomplished without unreasonable effort. Non-GAAP measures in respect of future periods which cannot be reconciled to the most comparable GAAP financial measure are calculated in a manner which is consistent with the accounting policies applied in Shell plc’s consolidated financial statements.  \nThe entities in which Shell plc directly or indirectly owns investments are separate legal entities. In addition to the term \"Shell\", in this Report \"Shell Group\", \"Group\", \"we\", \"us\" and \"our\" are also used to refer to the Company and its subsidiaries in general or to those who work for them. These terms are also used where no useful purpose is served by identifying the particular entity or entities. \"Subsidiaries \", \"Shell subsidiaries\" and \n\"Shell companies\" refer to those entities over which the Company has control, either directly or indirectly. Entities and unincorporated arrangements over which Shell has joint control are generally referred to as \"joint ventures\" and \"joint operations\", respectively. \"Joint ventures\" and \"joint operations\" are collectively referred to as \"joint arrangements\". Entities over which Shell has significant influence but neither control nor joint control are referred to as \"associates\". The term \"Shell interest\" is used for convenience to indicate the direct and/or indirect ownership interest held by Shell in an entity or unincorporated joint arrangement, after exclusion of all third-party interest. Shell subsidiaries’ data include their interests in joint operations. \nAs used in this Report, \"Accountable\" is intended to mean: required or \nexpected to justify actions or decisions. The Accountable person does not necessarily implement the action or decision (implementation is usually carried out by the person who is Responsible) but must organise the implementation and verify that the action has been carried out as required. This includes obtaining requisite assurance from Shell companies that the framework is operating effectively. \"Responsible\" is intended to mean: required or expected to implement actions or decisions. Each Shell company and Shell-operated venture is responsible for its operational performance and compliance with the Shell General Business Principles, Code of Conduct, Statement on Risk Management and Risk Manual, \nand Standards and Manuals. This includes responsibility for the operationalisation and implementation of Shell Group strategies and policies.Shell’s operating plan, outlook and budgets are forecasted for a 10-year period and are updated every year. They reflect the current economic environment and what we can reasonably expect to see over the next ten years. Accordingly, they reflect our Scope 1, Scope 2 and NCI targets \nover the next 10 years. However, Shell’s operating plans cannot reflect our 2050 net-zero emissions target and 2035 NCI target, as these targets are currently outside our planning period. In the future, as society \nmoves towards net-zero emissions, we expect Shell’s operating plans to reflect this movement. However, if society is not net zero in 2050 as of today, there would significant risk that Shell may not meet this target. \nShell’s \"Net Carbon Intensity\"  referred to in this Report include Shell’s \ncarbon emissions from the production of our energy products, our \nsuppliers’ carbon emissions in supplying energy for that production, and our customers’ carbon emissions associated with their use of the energy products we sell. Shell only controls its own emissions. The use of the term \"N et Carbon Intensity\"  is for convenience only and not intended \nto suggest these emissions are those of Shell plc or its subsidiaries. \nExcept where indicated, the figures shown in the tables in this Report are in respect of subsidiaries only, without deduction of any non-controlling interest. However, the term \"Shell share\" is used for convenience to refer to the volumes of hydrocarbons that are produced, processed or sold through subsidiaries, joint ventures and associates. All of a subsidiary’s production, processing or sales volumes (including the share of joint operations) are included in the Shell share, even if Shell owns less than 100% of the subsidiary. In the case of joint ventures and associates, however, Shell-share figures are limited only to Shell’s entitlement. In all cases, royalty payments in kind are deducted from the Shell share.  \nExcept where indicated, the figures shown in this Report are stated in US dollars. As used herein all references to \"dollars\" or \"$\" are to the US currency. \nThis Report contains forward-looking statements  concerning the financial \ncondition, results of operations and businesses of Shell. All statements \nother than statements of historical fact are, or may be deemed to be, forward-looking statements. Forward-looking statements are statements of future expectations that are based on management’s current expectations and assumptions and involve known and unknown risks and uncertainties that could cause actual results, performance or events to differ materially from those expressed or implied in these statements. Forward-looking statements include, among other things, statements concerning the potential exposure of Shell to market risks and statements expressing management’s expectations, beliefs, estimates, forecasts, projections and assumptions. These forward-looking statements are identified by their use of terms and phrases such as \"aim\", \"ambition\", \"anticipate\", \"believe\", \"could\", \"estimate\", \"expect\", \"goals\", \"intend\", \"may\", \"milestones\", \"objectives\", \"outlook\", \"plan\", \"probably\", \"project\", \"risks\", \"schedule\", \"seek\", \"should\", \"target\", \"will\" and similar terms and phrases. There are a number of factors that could affect the future operations of Shell and could cause those results to differ materially from those expressed in the forward-looking statements included in this Report, including (without limitation): (a) price fluctuations in crude oil and natural gas; (b) changes in demand for Shell’s products; (c) currency fluctuations; (d) drilling and production results; (e) reserves estimates; (f) loss of market share and industry competition; (g) environmental and physical risks; (h) risks associated with the identification of suitable potential acquisition properties and targets, and successful negotiation and completion of such transactions; (i) the risk of doing business in developing countries and countries subject to international sanctions; (j) legislative, judicial, fiscal and regulatory developments including regulatory measures addressing climate change; (k) economic and financial market conditions in various countries and regions; (l) political risks, including the risks of expropriation and renegotiation of the terms of contracts with governmental entities, delays or advancements in the approval of projects and delays in the reimbursement for shared costs; (m) risks associated with the impact of pandemics, such as the COVID-19 (coronavirus) outbreak; and (n) changes in trading conditions. Also see \"Risk factors\" on pages 15-26 for \nadditional risks and further discussion. No assurance is provided that future dividend payments will match or exceed previous dividend payments. All forward-looking statements contained in this Report are expressly qualified in their entirety by the cautionary statements contained or referred to in this section. Readers should not place undue \nAbout this Report\niv Shell Annual Report and Accounts 2022 \n Strategic \nReport\n2 Chair's message\n4 Chief Executive Officer's review\n6 Powering Progress strategy\n15 Risk factors\n27 Progress on strategy – year in review\n27 Performance indicators\n29 Generating shareholder value\n29 Group results\n31 Financial framework\n35 Market overview\n38 Integrated Gas\n44 Upstream\n52 Oil and gas information\n60 Marketing\n65 Chemicals and Products\n73 Renewables and Energy Solutions\n77 Corporate\n78 Our journey to net zero\n106 Respecting nature\n112 Powering lives\n121 Safety\n125 Principal decisions & stakeholders (Section 172(1) \nstatement)\nStrategic Report\n1 Shell Annual Report and Accounts 2022\n 1\nShell Annual Report and Accounts 2022"
    },
    {
        "question_1": "What year is the Shell plc Annual Report for?",
        "answer_1": "2023",
        "question_2": "By what percentage did Shell reduce its total combined Scope 1 and 2 greenhouse gas emissions from 2016 to 2023?",
        "answer_2": "31%",
        "question_3": "Who was the Chair of Shell plc mentioned in the 2023 Annual Report?",
        "answer_3": "Sir Andrew Mackenzie",
        "filename": "./docs\\shell-annual-report-2023.pdf",
        "first_5_page_texts": "Annual Report and Accounts for the year ended December 31, 2023 Shell plc\nShell plc\n#PoweringProgress\nAnnual Report  \nand Accounts\nFor the year ended December 31, 2023Contents\nIntroduction\niii Terms and abbreviations\nStrategic Report2 Chair's message\n4 Chief Executive Officer's review\n6 Powering Progress strategy\n6 Who we are \n7 Our strategy\n10 How we create value \n12Progress against our longer-term \nbusiness targets \n13 Outlook for 2024 and beyond\n14 Risk factors\n29 Performance in the year\n29 Performance indicators\n31 Generating shareholder value\n32 Group results\n34 Financial framework\n38 Market overview\n41 Integrated Gas\n47 Upstream\n55 Oil and gas information\n63 Marketing\n68 Chemicals and Products\n75 Renewables and Energy Solutions\n79 Corporate\n81 Other central activities\n82 Our journey to net zero\n83 Introduction\n85 Governance of climate-related risks and opportunities\n89 Energy transition strategy\n100 Climate risk management\n103 Climate-related metrics and targets\n114 Other regulatory disclosures\n116 Respecting nature\n124 Powering lives\n125 Contribution to society \n128 Our people \n133 Safety\n137 Living by our values\n141 Principal decisions & stakeholders (Section 172(1) statement)\nGovernance\n147 The Board of Shell plc\n155 Executive Committee\n157 Introduction from the Chair\n159 Statement of compliance with the UK \nCorporate Governance Code\n160 Governance framework\n162 Board activities\n166 Board evaluation\n167 Understanding and engaging with our stakeholders\n170 Workforce engagement\n172 Nomination and Succession Committee\n177 Sustainability Committee\n179 Audit and Risk Committee Report\n191 Directors' Remuneration Report\n194 Annual Report on Remuneration\n211 Directors' Remuneration Policy\n219 Other regulatory and statutory information\nFinancial Statements and Supplements\n229Independent Auditor's Report related to the \nConsolidated and Parent Company Financial Statements\n244 Consolidated Financial Statements\n317 Supplementary information - oil and gas (unaudited)\n336 Supplementary information - EU Taxonomy disclosure\n350 Parent Company Financial Statements\nAdditional Information\n361 Shareholder information\n365 Non-GAAP measures reconciliations\n373 Appendix: Significant subsidiaries and other \nrelated undertakings (audited)\nv About this Report\nvii Financial calendar\nDesign and  \nproduction: Friend  \nwww.friendstudio.com\nPrint: Toppan Merrill Reports are available in  \nall inclusive formats at  \nShell.com/annual-publicationsReporting for all\nTerms  and abbreviations\nCurrencies\n $ US dollar\n€ euro\n£ sterling\nUnits of measurement\n acre approximately 0.004 square kilometres\nb(/d) barrels (per day)bbl barrel\nboe(/d) barrels of oil equivalent (per day); natural gas volumes are \nconverted into oil equivalent using a factor of 5,800 scf \nper barrel\nGJ gigajoule\nGW gigawatt\nkboe(/d) thousand barrels of oil equivalent (per day); natural gas \nvolumes are converted into oil equivalent using a factor of 5,800 scf per barrel\nkWh kilowatt-hours\nmb/d million barrels per day\nmegajoule a unit of energy equal to one million joulesMMBtu million British thermal unitsmtpa million tonnes per annumMW megawattMWh megawatt hours\nNm3 normal cubic metreper day volumes are converted into a daily basis using a calendar yearscf(/d) standard cubic feet (per day)TWh terawatt hours\nProducts\n GTL gas-to-liquids\nLNG liquefied natural gasLPG liquefied petroleum gasNGL natural gas liquids\nMiscellaneous\nAct UK Companies Act 2006ADS American Depositary ShareAGM Annual General MeetingAPI American Petroleum InstituteAPM Alternative performance measureARC Audit and Risk CommitteeCCS carbon capture and storageCCS earnings earnings on a current cost of supplies basisCFFO cash flow from operating activitiesCISO Chief Information Security OfficerCMD Capital Markets DayCMF carbon management frameworkCO\n2 carbon dioxide\nCO2e carbon dioxide equivalent\nCOP2828th meeting of the Conference of the Parties to the United \nNations Climate Change Conferences\nCRC Carbon Reporting CommitteeCRT Commercial Road TransportCSRD Corporate Sustainability Reporting DirectiveDE&I Diversity, equity, and inclusion\nEC Executive Committee\nEMTN Euro medium-term noteEPS earnings per shareEPSA exploration and production sharing agreementEPTB Environmental Products Trading BusinessETS24 Energy Transition Strategy 2024\nEV Electric vehicle\nFCF free cash flowFID final investment decisionGAAP generally accepted accounting principlesGHG greenhouse gas\nHSSE health, safety, security and environment\nIAS International Accounting StandardsIEA International Energy AgencyIFRS International Financial Reporting Standard(s)\nIOGP International Association of Oil & Gas Producers\nIPCC Intergovernmental Panel on Climate Change\nIPIECAInternational Petroleum Industry Environmental Conservation \nAssociation \nIRM Information Risk Management\nISO International Organisation for Standardisation\nKPI Key performance indicator\nLGBT+ Lesbian, gay, bisexual and transgenderLTIP Long-term Incentive PlanNBS Nature-Based SolutionsNCF Net Carbon FootprintNCI net carbon intensityNGO Non-governmental organisationNOMCO Nomination and Succession CommitteeNZE Net zero emissionsOECD Organisation for Economic Co-operation and DevelopmentOFCF organic free cash flow OGCI Oil and gas climate initiativeOML oil mining leaseOPEC Organization of the Petroleum Exporting CountriesOPEC+ 12 members of the OPEC and 11 other non-OPEC membersOPL oil prospecting licencePSC production-sharing contract\nPSP Performance Share Plan\nQRA Quarterly Results AnnouncementR&D Research and developmentREMCO Remuneration CommitteeRNG Renewable natural gasRT real terms\nSEAM Safety, Environment and Asset ManagementSEC US Securities and Exchange Commission\nSGBP Shell General Business PrinciplesSIAI Shell Internal Audit and InvestigationsSP social performance\nSUSCO Sustainability Committee\nTCFD Task Force on Climate-related Financial DisclosuresTRCF total recordable case frequencyTSR total shareholder return\nWACC weighted average cost of capitalWTI West Texas Intermediate\n \niii Shell Annual Report and Accounts 2023 Strategic \nReport\nWe measure our performance for the year by considering \nprogress against our longer-term strategy and against our annual operating plan.\nAt Capital Markets Day 2023, we announced eight business targets \nfor reporting progress against our Powering Progress strategy, which can be found in the section \"Progress against our longer-term \nbusiness targets\" .\nPerformance against our operating plan for 2023 is assessed using a range of financial and non-financial indicators and can be found in the section \"Performance indicators\" .\nIn the \"How we create value\"  section, we show the value that we \nhave created in 2023 through our business activities for our different stakeholders and wider society.\n2 Chair's message\n4 Chief Executive Officer's review\n6 Powering Progress strategy\n6 Who we are \n7 Our strategy\n10 How we create value \n12 Progress against our longer-term business targets \n13 Outlook for 2024 and beyond\n14 Risk factors\n29 Performance in the year\n29 Performance indicators\n31 Generating shareholder value\n32 Group results\n34 Financial framework\n38 Market overview\n41 Integrated Gas\n47 Upstream\n55 Oil and gas information\n63 Marketing\n68 Chemicals and Products\n75 Renewables and Energy Solutions\n79 Corporate\n81 Other central activities\n82 Our journey to net zero\n83 Introduction\n85\n Governance of climate-related risks and opportunities\n89 Energy transition strategy\n100 Climate risk management\n103 Climate-related metrics and targets\n114 Other regulatory disclosures\n116 Respecting nature\n124 Powering lives\n125 Contribution to society \n128 Our people \n133 Safety\n137 Living by our values\n141 Principal decisions & stakeholders (Section 172(1) statement)\n1\nShell  Annual Report and Accounts 2023“For Shell, 2023 was a pivotal \nyear in our drive to achieve \nmore value with less emissions.”\nSir Andrew Mackenzie \nChairMy geologist's mind has always been intrigued by what lies beneath \nour feet, including the natural energy resources that have propelled the world's economic progress for so long. But with the  urgent  need \nto tackle climate change, I am just as fascinated by the technologies that will help the world deliver cleaner power and fuel the future, as well as significantly cut carbon emissions.\nAlong with great challenges, the energy transition offers tremendous \nopportunities to those eager to play their part. For well over a century, Shell has pioneered ways of providing energy to people. We are a leader in deep-water oil production, liquefied natural gas (LNG) \nand biofuels, and we aim to become one of the largest p roviders \nof charging for electric vehicles. \nWe aim to lead in the energy transition where we have competitive \nstrengths and see strong customer demand and clear support from governments. Our strategy is to create value for our shareholders, customers and wider society as we reduce our emissions and fulfil our purpose to provide more and cleaner energy solutions.\nFor Shell, 2023 was a pivotal year in our drive to achieve more value \nwith less emissions. It was the first year under our new Chief Executive Officer, Wael Sawan, who stressed the importance of enhancing our returns to shareholders, while staying firm on our target to become a \nnet-zero emissions energy business by 2050. We did exactly that by maintaining a very healthy balance sheet, increasing our dividends and continuing to buy back shares, all while investing capital to reduce our Scope 1 and 2 emissions, and Scope 3 emissions related to the use of the oil products we sell.\nPeople everywhere need a secure, sustainable and affordable energy \nsupply. Shell can help to enable a balanced energy transition by keeping the world moving with oil and gas, while delivering the low-carbon alternatives our customers need to decarbonise. To this end, we have made it clear that we plan to expand our LNG business and develop new low-carbon products and technologies, such as carbon capture and storage (CCS). \nI saw this when I visited Qatar's North Field expansion project in \nJanuary 2024. This project will support the delivery of much-needed supplies of natural gas around the world and I appreciated the opportunity to learn more about how we are developing a CCS project there. I also visited Oman and saw how we are moving \nforward with a hydrogen project, enabled by CCS. \nMore value, less emissions\nShell's 2023 earnings were strong and we reduced our total combined Scope 1 and 2 absolute greenhouse gas emissions from our operations by 31% [A] compared with 2016 levels. This positions us well as we continue \nto implement our strategy , guided by the free cash flow *, investment and \ncost reduction targets set in 2023. We will continue to create value for shareholders and lower emissions .\n[A] Reduc ed from 83 million tonnes carbon dioxide equivalent (CO2e) in 2016 to 57 million \ntonnes CO2e in 2023\n* Non-GAAP measure (see page 365).Strategic Report\nChair's message\n2 Shell Annual Report and Accounts 2023\n 2\nShell Annual Report and Accounts 2023"
    },
    {
        "question_1": "When did SoftBank Group Corp. start preparing its consolidated financial statements in accordance with the International Financial Reporting Standards (IFRS)?",
        "answer_1": "From the three-month period ended June 30, 2013",
        "question_2": "What is SoftBank Group Corp.'s (SBG) mission as stated in the 2023 annual report?",
        "answer_2": "Information Revolution—Happiness for everyone",
        "question_3": "What historical figure and organization does SBG draw inspiration from, as mentioned in their logo explanation?",
        "answer_3": "Sakamoto Ryoma and the Kaientai",
        "filename": "./docs\\SoftBank_annual-report_2023_en.pdf",
        "first_5_page_texts": "ANNUAL REPORT 2023\nSoftBank Group ReportDisclaimers\nThis Annual Report provides relevant information about SoftBank Group Corp. (“SBG”) and its subsidiaries (including together with SBG, the “Company”) and its affiliates (together with the Company, the “Group”) and does not constitute or form any solicitation of investment including any offer to buy or subscribe for any securities in any jurisdiction.\n In addition, this Annual Report does not constitute an offer to sell, or a solicitation of an offer to buy, any securities of Arm Limited. Any of fers to sell, solicitations of offers to buy, or sales of securities will be made in accordance with the registration requirements of the U.S. \nSecurities Act of 1933, as amended, and other applicable securities laws.\n This Annual Report contains forward-looking statements, beliefs or opinions regar ding the Group, such as statements about the Group’s future business, future position and results of operations, including estimates, forecasts, targets and plans for the Group. Without \nlimitation, forward-looking statements often include the words such as “targets,” “plans,” “believes,” “hopes,” “continues,” “expects,” “aims,” “intends,” “will,” “may,” “should,” “would,” “could,” “anticipates,” “estimates,” “projects” or words or terms of similar substance or the negative thereof. Any forward-looking statements in this Annual Report are based on the current assumptions and beliefs of the Group in light of the information currently available to it as of the date hereof. Such forward-looking statements do not represent any guarantee by any member of the Group or its management of future performance and involve known and unknown risks, uncertainties and other factors, including but not limited to, the success of the Group’s business model; the Group’s ability to procure funding and the effect of its funding arrangements; key person risks relating to the management team of SBG; risks relating to and affecting the Group’s investment activities; risks relating to SB Fund (defined as below), its investments, investors and investees; risks relating to SoftBank Corp. and the success of its business; risks relating to law, regulation and regulatory regimes; risks relating to intellectual property; litigation; and other factors, any of which may cause the Group’s actual results, performance, achievements or financial position to be materially different from any future results, performance, achievements or financial position expressed or implied by such forward-looking statements. For more information on these and other factors which may affect the Group’s results, performance, achievements or financial position, see “Risk Factors” on SBG’s website at https://group.softbank/en/ir/investors/management_policy/risk_factor. None of the Group nor its management gives any assurances that the expectations expressed in these forward-looking statements will turn out to be correct, and actual results, performance, achievements or financial position could materially differ from expectations. Persons viewing this Annual Report should not place undue reliance on forward-looking statements. The Company undertakes no obligation to update any of the forward-looking statements contained in this Annual Report or any other forward-looking statements the Company may make. Past performance is not an indicator of future results, and the results of the Group in this Annual Report may not be indicative of, and are not an estimate, forecast or projection of, the Group’s future results.\n The Company does not guarantee the accuracy or completeness of information in this Annual Report regarding companies (including, but not limited to, those in which SB Funds have invested) other than the Gr oup which has been quoted from public and other sources.\nRegarding TrademarksNames of companies, products and services that appear in this Annual Report are trademarks or registered trademarks of their respective companies. “Co., Ltd.,” “Ltd.,” “Corporation” and “Inc.” have been omitted from company names except in certain circumstances. \nImportant Notice – Trading of SBG Common Stock, Disclaimer Regarding Unsponsored American Depository Receipts\nSBG encourages anyone interested in buying or selling its common stock to do so on the Tokyo Stock Exchange, which is where its common stock is listed and primarily trades. SBG’s disclosures are not intended to facilitate trades in, and should not be relied on for decisions to trade, unsponsored American Depository Receipts (“ADRs”). SBG has not and does not participate in, support, encourage or otherwise consent to the creation of any unsponsored ADR programs or the issuance or trading of any ADRs issued thereunder in respect of its common stock. SBG does not represent to any ADR holder, bank or depositary institution, nor should any such person or entity form the belief, that (i) SBG has any reporting obligations within the meaning of the U.S. Securities Exchange Act of 1934 (“Exchange Act”) or (ii) SBG’s website will contain on an ongoing basis all information necessary for SBG to maintain an exemption from registering its common stock under the Exchange Act pursuant to Rule 12g3-2(b) thereunder. To the maximum extent permitted by applicable law, SBG and the Group disclaim any responsibility or liability to ADR holders, banks, depositary institutions, or any other entities or individuals in connection with any unsponsored ADRs representing its common stock.\n The above disclaimers apply with equal force to the securities of any of the Group which ar e or may in the future be the subject of unsponsored ADR programs, such as SoftBank Corp. or Z Holdings Corporation.\nNotice Regarding Fund Information Contained in This Annual ReportThis Annual Report is furnished to you for informational purposes and is not, and may not be relied on in any manner as, legal, tax, investment, accounting or other advice or as an offer to sell or a solicitation of an offer to buy limited partnership or comparable limited liability equity interests in any fund managed by a subsidiary of SBG, including SB Global Advisers Limited (“SBGA”), SB Investment Advisers (UK) Limited (“SBIA”) and any of their respective affiliates thereof (collectively, the “SB Fund Managers” and each an “SB Fund Manager”) (such funds together with, as the context may require, any parallel fund, feeder fund, co-investment vehicle or alternative investment vehicle collectively, the “SB Funds” and each an “SB Fund”). For the avoidance of doubt, the SB Funds include, among other funds, SoftBank Vision Fund L.P . (together with, as the context may require, any parallel fund, feeder fund, co-investment vehicle or alternative investment vehicle, the “Vision Fund I”), which are managed by SBIA and its affiliates; SoftBank Vision Fund II-2 L.P . (together with, as the context may require, any parallel fund, feeder fund, co-investment vehicle or alternative investment vehicle, the “Vision Fund II”), which are managed by SBGA and its affiliates; and SBLA Latin America Fund LLC (together with, as the context may require, any parallel fund, feeder fund, co-investment vehicle or alternative investment vehicle, the “SoftBank Latin America Fund”), which are managed by SBGA and its affiliates.\n None of the SB Funds (including the Vision Fund I , Vision Fund II and SoftBank Latin America Fund), the SB Fund Managers, any successor or futur e fund managed by an SB Fund Manager, SBG or their respective affiliates makes any representation or warranty, express or \nimplied, as to the accuracy or completeness of the information contained herein and nothing contained herein should be relied upon as a promise or representation as to past or future performance of the SB Funds or any other entity referenced in this presentation, or future performance of any successor or the future fund managed by an SB Fund Manager.\n Information relating to the performance of the SB Funds or any other entity refer enced in this Annual Report has been included for background purposes only and should not be considered an indication of the future performance of the relevant SB Fund, any other entity  \nreferenced in this Annual Report or any future fund managed by an SB Fund Manager. References to any specific investments of an SB Fund, to the extent included therein, are presented to illustrate the relevant SB Fund Manager’s investment process and operating philosophy only and should not be construed as a recommendation of any particular investment or security. The performance of individual investments of an SB Fund may vary, and the performance of the selected transactions is not necessarily indicative of the performance of all of the applicable prior investments. The specific investments identified and described in this Annual Report do not represent all of the investments made by the relevant SB Fund Manager, and no assumption should be made that investments identified and discussed therein were or will be profitable.\n The performance of an SB Fund in this Annual Report is based on unrealized valuations of portfolio investments. Valuations of unr ealized investments are based on assumptions and factors (including, for example, as of the date of the valuation, average multiples of \ncomparable companies, and other considerations) that the relevant SB Fund Manager believes are reasonable under the circumstances relating to each particular investment. However, there can be no assurance that unrealized investments will be realized at the valuations indicated in this Annual Report or used to calculate the returns contained therein, and transaction costs connected with such realizations remain unknown and, therefore, are not factored into such calculations. Estimates of unrealized value are subject to numerous variables that change over time. The actual realized returns on the relevant SB Fund’s unrealized investments will depend on, among other factors, future operating results, the value of the assets and market conditions at the time of disposition, any related transaction costs and the timing and manner of sale, all of which may differ from the assumptions and circumstances on which the relevant SB Fund Manager’s valuations are based.\n Past performance is not necessarily indicative of future results. The performance of an SB Fund or any futur e fund managed by an SB Fund Manager may be materially lower than the performance information presented in this Annual Report. There can be no assurance that \neach SB Fund or any future fund managed by the relevant SB Fund Manager will achieve comparable results as those presented therein.\n The actual realized retur n on unrealized investments by an SB Fund may differ materially from the performance information indicated in this Annual Report. No assumption should be made that investments identified and discussed in this Annual Report were or will be \nprofitable, or that investments made in the future will be comparable in quality or performance to the investments described therein.\n Third-party logos and vendor information included in this Annual Report are provided for illustrative purposes only. Inclusion of such logos does not imply affiliation with or endorsement by such firms or businesses. There is no guarantee that an SB Fund Manager, an SB \nFund’s portfolio companies, any future portfolio companies of a future fund managed by an SB Fund Manager or SBG will work with any of the firms or businesses whose logos are included in this Annual Report in the future.\n SBGA and SBIA manage separate and independent operations and processes from each other and those of SBG in the management of V ision Fund I, Vision Fund II and SoftBank Latin America Fund, respectively. Any SB Funds managed by SBGA or SBIA are solely managed \nby SBGA or SBIA respectively.For consolidated financial statements and notes, see “Financial Report 2023” on our website.Table of Contents\n 111 Major Subsidiaries and Associates\n 114 Stock Information\n 115 Corporate Data111 Corporate Information 12 Message from Our CEO\n 16 Message from Our CFOCompany Names\nCompany names and abbreviations used in this Annual Report, unless otherwise stated or interpreted differently in the context, are as follows.\nCompany names and abbreviations Definition\nSoftBank Group Corp. or SBG ⾣SoftBank Group Corp. (stand-alone basis)\nThe Company ⾣SoftBank Group Corp. and its subsidiaries\nThe Group ⾣Softbank Group Corp., its subsidiaries and associates\nSB Northstar or asset management subsidiaries ⾣SB Northstar LP\nSoftBank Vision Fund 1 or SVF1 ⾣SoftBank Vision Fund L.P. and its alternative investment vehicles\nSoftBank Vision Fund 2 or SVF2 ⾣SoftBank Vision Fund II-2 L.P. \nSoftBank Latin America Funds or LatAm Funds ⾣SBLA Latin America Fund LLC\nSoftBank Vision Funds or SVF ⾣SVF1, SVF2, and LatAm Funds\nSBIA ⾣SB Investment Advisers (UK) Limited\nSBGA ⾣SB Global Advisers Limited\nArm ⾣Arm Limited\nAlibaba ⾣Alibaba Group Holding Limited\nSoftBank ⾣SoftBank Corp. \nSprint ⾣Sprint Corporation\nT-Mobile ⾣T-Mobile US, Inc. Adoption of IFRSs\nThe Company has prepared the consolidated financial statements in accordance with the International Financial Reporting Standards (IFRS) from the three-month period ended June 30, 2013 (the first quarter of the fiscal year ended March 31, 2014). The date of transition to IFRS was April 1, 2012. The financial data for the year ended March 31, 2013, has also been presented based on IFRS.\nDefinition of Terms\n“Fiscal 2022” refers to the fiscal year ended March 31, 2023, and other fiscal years are referred to in a corresponding manner in this Annual Report. “FYE” denotes the fiscal year-end. For example, “FYE2022” denotes March 31, 2023, the last day of fiscal 2022.\nNotice Regarding PFIC Status\nSee “IR Disclaimers” on our website for details.2 Who We Are\n 2 Our Unchanging ࢤ Kokorozashi (Mission), Ever-Changing Areas of Investment \nInformation Revolution—Happiness for Everyone\n 4 Our Vision for a Better World\n 6 A Business Model with Three Inputs \n 8 Our ࢤ Kokorozashi (Mission) is Consistent \n  Our Investment Areas Continue to Evolve\n 10 SoftBank’s Next 30-Year Vision: A Story of Value Creation\n20 Growth Assets\n 20 NAV (Net Asset Value) & LTV (Loan to Value)\n 22 Message from SoftBank Vision Funds Management\n 25 SoftBank Vision Funds In Focus\n 30 Message from Arm CEO\n32 Foundation for Our Growth\n 32 Our Sustainability\n 36 Sustainability: Environment\n 40 Sustainability: Social\n 44 Sustainability: Governance\n 56 Message from External Board Director\n 58 Compliance\n 60 Risk Management\n 61 Message from Our Chief Risk Officer (CRO)\n 62 Risk Factors\n 69 Calculation of Equity Value of Holdings and Net Debt\n70 Financial Section\n 71 Graphs: Key Consolidated Financial Data\n 72 Eleven-Year Key Consolidated Financial Data\n 74 NAV & LTV\n 75 Management’s Discussion and Analysis of Results of Operations, Financial Position, \nand Cash Flows\n SoftBank Group Report 2023\n1\nFinancial Section Corporate Information Foundation for Our Growth Growth Assets Message from Our CEO Message from Our CFO Table of Contents Who We AreInformation Revolution—Happiness for everyone\nSBG has always remained true to its goal of making the world a happier place \nthrough the Information Revolution.\nJust what is happiness?Some might say happiness is to love and be loved in return, or to make the most \nof each day. Others might derive happiness from self-expression. Still others might find happiness in something as simple as a smile. Above all, SBG equates happiness with inspiration. Through our business, we strive to bring emotional meaning and happiness to lives. In everything we do, we aim to drive the Information Revolution and build a more connected, empowered, and joyful world. This unchanging kokorozashi  (mission) is encapsulated in our philosophy, \nInformation Revolution—Happiness for everyone.\nHumankind stands on the cusp of the digital Big Bang. Computing performance \nis increasing dramatically, and we are getting ever closer to an age of super-intelligent machines that will surpass the human brain. Our mission is to harness the raw, unlimited power of the Information Revolution and channel it in a direction that makes people happier. This aspiration will continue to drive our organization toward further growth for many years to come.\nInformation Revolution\n—Happiness for EveryoneOur Unchanging ࢤ Kokorozashi (Mission),\nEver-Changing Areas of Investment\n SoftBank Group Report 2023\n2\nFinancial Section Corporate Information\nTable of Contents Foundation for Our Growth Growth Assets Message from Our CFO Message from Our CEO Who We AreImagine a group of visionaries who share the \nsame unshakable spirit (kokorozashi). They act \nwith one mind to achieve their ideals, braving all dangers to usher in a new era amid upheaval. SBG draws inspiration from one such group—the Kaientai, an enterprising shipping company founded in 1865 by the visionary Sakamoto Ryoma. Supplied with the best intelligence and possessing abundant knowledge and wisdom, the Kaientai and its founder rejected age-worn feudalistic values in favor of free thinking and bold action. In this way, they led a revolution that resulted in the modernization of Japan. Our corporate logo derives from the Kaientai’s flag. It represents our admiration for, and belief in, the Kaientai’s single-minded pursuit of their vision, which imagined a Japan 100 years in the future.\n SBG is a fleet of similar visionaries. Our vessels \nfly the banner of the 21st-century Kaientai, symbolizing our own single-minded pursuit of a vision: Information Revolution—Happiness for everyone.A two-line design—the banner of the Information Revolution that SBG hoists as we sail \ntoward a new dawn\nKaientai banner SoftBank Brand Symbol\n SoftBank Group Report 2023\n3\nFinancial Section Corporate Information Foundation for Our Growth Growth Assets Message from Our CEO Table of Contents Who We Are\nMessage from Our CFO"
    }
]