[
    {
        "question_1": "What was the percent change in net revenue for Tesla between 2020 and 2021?",
        "answer_1": "71% increase",
        "question_2": "How did Amazon's R&D spending change from 2019 to 2020?",
        "answer_2": "Increased by 35%",
        "question_3": "What was the difference in total assets held by Microsoft at the end of fiscal years 2020 and 2021?",
        "answer_3": "$50 billion increase",
        "question_4": "How much did Apple's net income change between 2019 and 2020?",
        "answer_4": "Increased by $9 billion",
        "question_5": "By how much did Netflix's international subscriber base grow from 2020 to 2021?",
        "answer_5": "Over 25 million",
        "question_6": "What was the change in Google's advertising revenue from 2019 to 2020?",
        "answer_6": "Increased by 12%",
        "question_7": "How much did Walmart's e-commerce sales grow in the fiscal year 2021 compared to 2020?",
        "answer_7": "69% increase",
        "question_8": "What was the change in total debt for Coca-Cola from 2019 to 2020?",
        "answer_8": "$7 billion increase",
        "question_9": "By how much did the number of employees at Facebook increase between 2019 and 2020?",
        "answer_9": "30% increase",
        "question_10": "What was the percent change in operating income for Nike between 2020 and 2021?",
        "answer_10": "Dropped by 2%",
        "filename": "./docs\\OCBC-2023-annual-review-en.pdf",
        "contexts": "Nestlé – Annual Review 2023\nNestlé.\nWe unlock the power of food \nto enhance quality of life for everyone, \ntoday and for generations to come.Annual Review 2023Our purpose\nContents Accompanying reports\nYou can find more information  \nabout the Nestlé Group at  \nwww.nestle.com\nFind out more about Creating Shared \nValue at www.nestle.com/csvOnlineFront cover\nMilo As the world’s leading chocolate malt beverage, Milo delivers nutritious \nenergy and encourages kids to stay active and grow with sports, engaging over 30 million kids annually through grassroots sports programs.Corporate Governance Report 2023 Compensation Report 2023 Financial Statements 2023  2  L etter to our shareholders \n 4   Our  people on the ground\n 8  Implementing our  growth   \n  strategy \n 12  Cr eating Shared Value\n 16 C onnecting through our brands\n 32  Financial r eview  \n 56  C orporate Governance  \n  and C ompliance\n 63  Shar eholder informationNestlé. Unlocking the power of food to enhance quality of life for everyone, \ntoday and for generations to come.Nestlé Annual Review 20231A summary of the 2023  \nfull-year results is shown here. \nFor full results, please consult \nthe ’Financial review‘ section.\n* Financial performance \nmeasures not defined by \nIFRS Accounting Standards. \nFor further details, see \n’Financial review’ on page 34.Group sales (in CHF) Organic growth * Real internal growth *\n93.0  billion + 7.2% – 0.3%\nUnderlying trading \noperating profit *  \n(in CHF)Underlying trading \noperating profit  \nmargin *Underlying trading  \noperating profit  \nmargin *\n16.1  billion 17.3% + 40  Basis points\nConstant currency\nTrading operating  \nprofit * (in CHF)Trading operating  \nprofit margin *Trading operating  \nprofit margin *\n14.5  billion 15.6% + 190  Basis points\nConstant currency\nEarnings per share  \n(in CHF)Earnings  \nper shareUnderlying earnings  \nper share *\n4.24 + 23.7% + 8.4%\nConstant currency\nOperating cash flow  \n(in CHF)Free cash flow * \n(in CHF)\n15.9  billion\n32.1% of net financial debt10.4  billion\nProposed dividend  \n(in CHF)Proposed dividend  \nincrease\n3.00 + 1.7%Our financial performance\nOur Nutrition, Health and Wellness strategy is fundamental to how we create value.What we sell (in CHF billion)\nWhere we sell (in CHF billion)\nNumber of employees Number of countries we sell in\n270 000 188\nTotal group salaries and social  \nwelfare expenses (in CHF)Corporate taxes paid in 2023  \n(in CHF)\n14\nbillion2.8\nbillionOur business\nWe apply our expertise in nutrition, health and wellness to help people and pets \nlive happier, healthier lives. We do this alongside ambitious sustainability goals \nto generate significant value for our shareholders and other stakeholders alike.\nPowdered and \nLiquid Beverages\nConfectionery Water24.8Prepared dishes  \nand cooking aids\n11.7\n8.1 3.3Milk products \nand Ice cream\n11.0Nutrition and \nHealth Science\n15.3PetCare\n18.8\nGC\n5.5EUR\n22.3\nAOA\n19.9LATAM\n12.8NA\n32.5Our key non-financial  \nperformance\nWe create shared value through our social and environmental commitments  \nand supporting actions.\nTo measure our progress, \nwe use a comprehensive set of indicators that support our business performance and generate value for our shareholders and other stakeholders. Some key performance indicators are included here – the full set is  in our Creating Shared Value and Sustainability Report.Climate Our KPI  *\nWe aim to reduce our greenhouse gas (GHG) emissions by 20% by 2025 and 50% by 2030 from 2018 levels, on the road to net zero by 2050 at the latest 13.58%  \nnet reduction of GHG emissions versus 2018 baseline  (a)\n(a) Covers emissions related to our net zero commitment.  \nNet reductions (%) includes removals from both insetting and landscape projects.\nNature Our KPI  *\nWe aim to achieve and maintain \n100% assessed deforestation-free primary supply chains (for meat, palm oil, pulp and paper, soy and sugar) by 2022 and 2025 for cocoa and coffee 93.4%\nassessed deforestation-free for stated primary supply chains\nPackaging Our KPI  *\nBy 2025, we aim to reduce virgin plastics by one third versus our 2018 baseline14.9%\nvirgin plastic reduction versus 2018 baseline\nDiversity, equity \nand inclusionOur KPI  *\n46.4%\nmanagement positions held by women\nYouth Our KPI  *\nBy 2030, our ambition is to \nhelp 10 million young people around the world have access to economic opportunities 7.74  million\nyoung people around the world with access to economic opportunities  \nsince 2017\nHealth and Nutrition Our KPI  *\n127.6  billion\nservings of affordable nutrition with micronutrient fortification  \nprovided in 2023* Non-financial performance \nmetrics are defined  in the Reporting Scope  and Methodology for ESG KPIs document available  at www.nestle.com/esg-kpis\n EY  has performed limited \nassurance on the six key performance indicators  on this page. The assurance statement with EY’s independent conclusion can be found at www.nestle.com/assurance-statementNestlé Annual Review 20232Pursuing significant \nglobal opportunities\nNutrition, Health and Wellness is our past, present  \nand future, and within that frame we continue to set  \nnew priorities. Our innovation capabilities enable us  \nto consistently meet the rising expectations of a \ngrowing population. Portfolio optimization over the \npast years allows us to focus our efforts on our proven \nbrands. Our operational excellence enables us to \ndependably deliver sustainable, profitable growth. And \nwe continue to do business in a way that creates shared \nvalue for both our shareholders and society. \nEncouraging balanced diets\nFoods and beverages are major drivers of long-term \nhealth, and consumers increasingly recognize this. We \nwill continue to develop nutritious products that support \npeople’s well-being, and we believe that such products \nwill see increased demand in the years to come. \nIn fact, in 2023, we reconfirmed our ambition to \nprioritize the development of our more nutritious \nproducts. This entails launching new products and \nrenovating existing ones. It involves expanding \nmicronutrient fortification, growing our affordable \nofferings, reducing sugar and salt content, and \nincreasing our use of plant-based ingredients in \nour recipes.Dear fellow shareholders,\nAs the Good food , Good life  company, Nestlé  \nis proud to provide consumers with products \nthey love and rely on. Even in the face of ongoing \nglobal challenges this past year, we stay true to \nour long-term ambitions and see a bright future \nwith emerging opportunities.Additionally, we are actively guiding people towards \na more balanced diet by making the nutritional value \nof our portfolio more transparent. We are strengthening \nour responsible marketing of indulgent products, \nproviding clear front-of-pack portion guidance, and \nengaging with and informing consumers through our \nvarious online communities around the world. \nSupporting healthy aging\nNestlé’s food and beverage portfolio caters to people \nat each stage of their life. It starts with the first \n1000 days and continues into adulthood and old age. \nWith a rapidly aging global population, we see an \nopportunity to provide products that can support the \nnutrition, health and wellness of older people. We can \nhelp boost their energy levels, enhance their cognitive \nhealth, support their mobility, and improve their general \nphysical and mental health. \nWe already offer several Nestlé Health Science and \ndairy products that are specifically targeted to seniors. \nTake, for example, successful brands like Boost, Pure \nEncapsulations  or Molico . With our capabilities, we \nbelieve that we can leverage this trend across all of our \ncategories to further grow. \nInvesting in innovation  \nWe are investing in our future through innovation \nand entrepreneurship. Through our main research \ncenter in Switzerland and 23 sites globally, and with \nan industry-leading R&D budget, we develop products \ntailored to the diverse needs of people and pets while \nreducing our environmental footprint. Experts at our \nnewly inaugurated Institute of Agricultural Sciences, \nfor example, develop solutions in the areas of plant \nscience, agricultural systems and dairy livestock.  \nThis is in addition to our four other research institutes \nlooking at health sciences, food sciences, food safety \nand packaging. \nDigital technologies, including artificial intelligence (AI), \nare supporting sharper decision-making and increased \nspeed across the entire company. From procurement to \ne-commerce, digital analytics facilitate efficiency and Nestlé Annual Review 20233U. Mark Schneider, Chief Executive Officer (left), and Paul Bulcke, Chairman (right)\neffectiveness. Data science and AI increasingly support \nus with innovation by revealing and predicting consumer \ndemands, while also helping us bring new products to \nmarket faster.\nCreating Shared Value\nCreating Shared Value is how we do business at Nestlé, \ngenerating value not only for our shareholders but also \nfor society. Nestlé’s long-term success is supported  \nby this approach.\nAn example of this is Nestlé’s efforts to advance \nregenerative food production by helping protect, renew \nand restore natural resources. To that end, we are \nsupporting farmers and strengthening their communities. \nWe are delivering on our commitments in a way that \nappeals to consumers’ increased expectations.\nRemaining dedicated and dependable\nEvery year, our people show us how much can be \nachieved when we steadfastly pursue opportunities. We \nknow that we do not have all the answers, but with our Paul Bulcke\nChairmanU. Mark Schneider\nChief Executive Officerglobal mindset combined with our expert knowledge of \nlocal consumers and markets, we are confident we can \ndeliver on our ambition and our commitments. \nPeople all over the world rely on Nestlé for good food  \nand beverages. Our proven value creation model allows \nus to invest, innovate and grow even in challenging \ntimes, and makes us dependable for our shareholders \nand other stakeholders. We are grateful for the support \nof our employees, business partners, consumers and \ncommunities. And we thank you, our shareholders, for \nyour continued trust.Nestlé Annual Review 20234Our people  \non the ground\nWe engage with our fellow employees, business partners and \ncommunity members. From meeting with farmers to visiting \nretailers, touring our factories and doing volunteer work,  \nour culture encourages and supports connecting with internal \nand external stakeholders.Nestlé Annual Review 20235Nestlé Annual Review 20236"
    }
]